# map, with rooms and connections between them
module Map
  # define the room class
  class Room
    def initialize(name, description)
      @name = name
      @description = description
      @paths = {}
    end

    # these make it easy for you to access the variables
    attr_reader :name
    attr_reader :paths
    attr_reader :description

    def go(direction)
      return @paths[direction]
    end

    def add_paths(paths)
      @paths.update(paths)
    end
  end

  # descriptions for rooms
  # long line rubocop yelling ahoy!
  CENTRAL_CORRIDOR = Room.new('START',
                              """
    An Ordinary Day at the Browning School Part 1
    By Maximilian Motz
    
    DISCLAIMER: Every character in this game is NOT a real person at Browning in order for me to avoid conflict.
    If you think you weren't accurately portrayed in this game, your wrong cuz its NOT YOU!
    BTW the player is YOU, not the fictional version of me or otherwise
    
    You awaken
    Lucky you, its panther day (this is fiction btw) at Browning and you have no classes!
    Don't get the wrong idea though, your momma's still gonna make you go to school...
    
    Type anything to continue
                              """)

  SHOOT = Room.new('Death', 'You shoot and miss. He shoots you and you die.')

  DODGE_DEATH = Room.new('Death', 'You try to dodge. He shoots you and you die.')

  BEDROOM = Room.new('bedroom',
                                 """
    Your in your room, what do you do:
    1. Get dressed
    2. Go back to Sleep
    3. Go to the Bathroom
    4. Go to the Diningroom
    5. Leave the Building
    Answer should be given as number of choice
                                 """)
                            
   DRESSED = Room.new('getting dressed',
                              """
      What do you want to wear?
      1. Something Plain
      2. Something swanky
      3. A sweatshirt
                              """)
        
    DRESSED1 = Room.new('normal clothes',
                              """
    You choose a white shirt and a red tie.
    
    Type anything to continue
                              """)
    DRESSED2 = Room.new('groovy clothes~',
                              """
    You choose a bright purple shirt and a bright green sparkly bow tie.
    
    Type anything to continue
                              """)
                            
    DRESSED3 = Room.new('total rebel',
                              """
    You put on a red sweatshirt with the Browning logo on it
    
    Type anything to continue
                              """)
                              
    SLEEPWIN = Room.new('sleep ending',
                              """
    You decide to go back to bed cuz this day is a waste of your time.
    zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz
    zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz..........
    z?
    You sleep through the whole day and that was that
    YOU WIN! CONGRATULATIONS
                              """)
                              
   BATHROOM = Room.new('bathroom',
                              """
    Would you like to:
    1. Brush your teeth
    2. Take a Shower
    3. Go to the toilet
    4. leave
                              """)
                              
    BATHROOM1 = Room.new('brushy brushy',
                              """
    clean and white and very nice
    
    Type anything to continue
                              """)
    
    BATHROOM2 = Room.new('nice and clean :)',
                              """
    Your squeaky clean now
    
    Type anything to continue
                              """)
    
    BATHROOM3 = Room.new('all done',
                              """
    Kek, you did your business
    
    Type anything to continue
                              """)
    
    DROOM = Room.new('dining room',
                        """
    What would you like to eat?
    1. Milk and cereal
    2. Cereal and milk
    3. Waffles
    4. a singular whole banana
    5. Omlette
    6. Leave
                        """)
    
    DROOM125 = Room.new('YUM',
                        """
    OMNOMNOM
                        
    Type anything to continue
                        """)
    
    DROOM3 = Room.new('old reference...',
                        """
    DO YOU LIKE WAFFLES?
    YEAH WE LIKE WAFFLES!
                        
    Type anything to continue
                        """)
                        
    DROOMDEATH = Room.new('Death', 'You *accidentally* put the whole banana in your throat and choke and die.')

    SPACE = Room.new('spatial distortion',
                        """
    You start walking to school, but realize
    That space and time have fallen appart
    Instead of the world being how you once knew it to be
    It is shreded into billions of different pieces
      
    You are on a platform of land with your house
    There are other platforms around, as well as an abyss below you
    Do you:
    1. Jump one by one to each platform, attempting to get to school
    2. Jump into the void
    3. Go inside and call it a sick day
    
                        """)
    
    SPACE1 = Room.new('distortion spatial',
                        """
    You sucessfully jump to the next platform
    And the next one
    And th- WAIT
    There are three hooded figures standing on the platform in front of you
    They don't seem to notice you as they are hudled together
    
    Type anything to continue
                        """)
    
    SPACEDEATH = Room.new('Death', 'You died, what didja think would happen?')
    
    SPACEWIN = Room.new('space ENDING',
                        """
    You go inside, as if nothing ever happened
    YOU WIN
                        """)
                        
    HUDDLE = Room.new('more spatial distortion',
                        """
    What will you do to with these hoodlums:
    1. Fight them
    2. Converse with them
    3. Eavesdrop on their conversation
    4. Ignore them
                        """)
                        
    HUDDLEDEATH = Room.new('Death', 'You throw a punch at the closest one
    You sucessfull hit him, however his friend takes out
    A shotgun blows your head off')
                        
    HUDDLE2 = Room.new('eavesdropping',
                        """
    You say hi and introduce yourself
    They all turn around to look at you, then
    They all scatter out of there
    Oh well, you continue toward the school
      
    Type anything to continue
                        """)
    
    HUDDLE3 = Room.new('greeting the strangers',
                        """
      You sneak up to their huddle, close enough to hear their whispers
      'HAHAH, we actually DID IT, we destroyed space and time along with the Browning School'
      One of them says
      His friends cackle with him
      'I can't believe it was that EASY'
      The 2nd one scoffs
      'Yeah, not a single person tried to stop us'
      The 3rd one YAHOOs out of his mouth
      The 1st one starts doing a dance, but ends up noticing you,
      which causes him and the others to scatter
      You continue your journey toward the school
      
      Type anything to continue
                        """)
                        
    FINALE = Room.new('front of the school',
                        """
    You've arrived at the Browning school
    Or what's left of it, atleast...
    You see the head of the school, Dr. soul, weeping on the ground
    He Yells, 'THIS WASN'T SUPPOSED TO BE LIKE THIS,
    'O WHAT MISERY!'
    He scrambles up to you and grabs you by the collar hysterically
    'Your Browning, along with space and time's FINAL HOPE,' he blurts out
    'PLEASE, use this time machine and save my school'
    What do you do:
    1. Accept
    2. Decline
    3. Ask him why he cannot do it himself
                        """)
                        
    FINALY = Room.new('part 1 END',
                        """
    Before you could respond to his plight, he throws you into
    this time machine and you appear in front of the Browning school
    However, this seems like an actually ordinary day
    FIN PART 1
    
    Continue?
    Type anything
                        """)
    
    DLC = Room.new('DLC',
                        """
    THE NEW AnOrdinaryDayAtTheBrowningSchool 'DLC' HAS BEEN SUCESSFULLY DOWNLOADED, CONGRATULATIONS
    
    LOADING...
    
    You arrive at the Browning school, as if it was an ordinary day (JUST LIKE THE TITLE OF THE GAME!!!!!!!!!!)
    You shake Mr. Motzarella cheese's hand and enter the building
    You check your phone for the time, it's 8:13 am
    BETTER HURRY TO CLASS
    Do you:
    1. Run up stairs to your homeroom
    2. Go downstairs to the lockeroom
    3. Do nothing
    4. F̶̢̖̯͔̱͚̱̼̣̫̬͕̕J̴͜҉̬̲̮͙̙̭͚̯̳̳̪͓̼̳͈͎̱̀Ǫ̨͇͎͍̫̟̼̱̀̕͢D̛҉҉̭̪͉̗̘̝̦̫Ş̛̯̟̭̖̪̬̗̬̩̭͜J͢͏̡̻̟̙̭̫̦̝̙̜̩͓͚̙̣F̴̳͔͓̟̣̬͎͇͖̕̕͜Ọ͚̠̺̖͈͍͖̞͇͕̙̼͟͡͞ͅJ҉̷̙̻̦̲̣͓͔̬̰̟͈̯͍̬̪͉͎̯́ͅA̩̟̝͖͎͎̫̜͜͡Ķ͜҉̦̼̘̟̼̦̮͕̘̯͙͟ͅĹ̸̛̖̳͖̙͔͔̺̬̣͈̬͔͙̻̯̦͡ͅͅS̭̟͙͎͘F͟͏̴҉̥͙͙̣͈̬̳̖̠͔͓̙̖̦̪ͅͅͅK̛̗̤̹̥͙̦̱J̶̡̹͓̹̝͇̤̥̥͍͢͠F̸̸̧̤͉̗͖͖̪̝͉̲́͜N̸̴̗̻̟͖̩͇͉̰͈͇̣͇̭͘͜E͏̢̙̰͉̲̼̗̼̝̻͡͡J̵͚͈̙͙̦̱̳̟̼̭̰͈͕̖͎̖͇͟F̸̨̪͓̼̰̘̱̰͇̰͎̣̖̰̱̪͉͕̖̦͜͝N̡͎̰̮̳̰̝͖͍̙̗̘̱̱̜͝ͅͅŚ͓̩̮̻̠̬͇̮̬̦̣͉͈J̢̢͞҉̣̰̟͕̠̲ͅN̷̨̺̗̝̞̩̻̬͈̞ͅF҉͏̼̘͇̭
    
                        """)
 
   DLC1 = Room.new('homeroom',
                        """
    You rush up to homeroom and frantically open the door
    ...but the door is actually locked cuz Mr. Mag is not here yet
    oh...
    lol...
    haha...
    wow...
    cool...
    neat...
    ...
    ...
    ellipse...
    overusingellipse...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    1. Go to the other homeroom
    2. 
                        """)
  
  QHOMEROOM = Room.new('other homeroom',
                        """
    It's locked too... oh well... guess you'll just...um...go home and win?
    
    SNOITALUTARGNOC! EPYT EUNITNOC
    
                        """)
    
  DLC2 = Room.new('slacker',
                        """
    You go to the locker room to hang out with some of your friends.
    You chat to them for a while, but then you realize your way past late!
    You run up to your homeroom frantically, but alas, DETENTION
    
    GAME OVER, YOU LOSE
    
                        """)
                        
  DLC3 = Room.new('...',
                        """
    You stand in the lobby of the school doing nothing.
    You'll be late, but whatever, your doing nothing!
    What would you like to do next:
    1. Nothing
    2. Nothing
    3. Nothing
    4. Nothing
    5. Nothing
    6. Nothing
    8. Nothing
    9. Nothing
    10. Nothing
    
                        """)
  
  NOTHING = Room.new('nothing',
                        """
    You continue to do nothing. As time passes, everything seems to be moving except yourself. You stand in place when you hear the first period bell ring, you stand in place when you hear the last period bell ring, you stand in place when the school is closed for the night. Night and day mean nothing as you continue to stand in place. Just standing. In place. Day after day after day after day. Days turn into weeks, then months, then years, then decades, then centurys. Time doesn't even matter at this point. Browning does not even exist anymore. Nothing even exists anymore. Yet, you still stay there standing, and standing, and standing. You know nothing will happen. You know nothing can happen. Yet you continue to stand. There are so much better things you could have done, you could have lived a fantastic life, had a big family, and die knowing everyone loved you. Or, you could have been a murderous psycopath, who had a long, painful, and awful life. Still, it would've made for a more interesting life than standing in place and doing absolutely nothing. Just standing. Doing nothing. You may as well not be there, or even nonexistent. No one acknowledges you standing there, no one cares about you standing there. No one wanted you to stand there, but no one didn't want you to stand there. Did you even want to stand there yourself? You did select the option to stand there. Did you think this is what it entailed? probably not. Sorry about that. Did you expect to win again? Because this is actually a game over. Or a victory. Its both and neither at the same time. Its truly, nothing more than nothing. Just nothing. Nothing at all. Nothing. Nothing. Nothing. Nothing. Nothing. No you. No game. No victory. No loss. Nothing, absolutely nothing. Nil. Zilch. Zero. Null. Undefined. Void. Empty. Blank. 0. Nothing left to do, nothing left to say, nothing left to choose, just leave this page already. Why are you even reading this. I purposefully made it long asf just so you would get bored and continue the frickin game. Its just a bunch of nothing. Nothing. Not-a-thing. WAIT, YOU THINK SOMETHING IS ABOUT TO HAPPEN. SOMETHING! Oh, but it's actually nothing. Wow. Great. Haha. Great Fakeout. 10/10. Um, I should probably get to my English essay since it's 9:42 PM 2/4/2018 when I'm typing this, so if you are expecting a reward for reading all of this. Um,.............................................................................................Thank you................................................................................................................................................And............................................................................................................................................I......................................................................................................................................................LOVE.............................................................................................................................................................................YOU!....................................................................................................................................................<3............................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................~NOTHING~............................................................................................................................................................................................................................................................~NOTHING AT ALL~........................................................................................................................................................................................................ GAMEOVER, YOU LOSE, type Easteregg to continue
    
                        """)
  
  EASTER = Room.new('EASTER EGG FOUND!',
                        """
   CONGRATULATIONS PLAYER! YOU HAVE ENCOUNTERED AN EASTEREGG!
   CONGRATULATIONS ON UNCOVERING 'ư̫̠̬̣̫̯̩͔̟̺̻̍ͪ́̈̄ͯ̚ņ̵̪̙̲̼͚̙̼̗͎̤̽ͧ̈́͆͞͡ͅͅͅͅd̡̩͈̻͇̦͓̘̘̍͒ͧ̽ͫ̀ͮ̏ͨ͆ͭͨ́͠ͅe̅̂̌̀̐͗́̐́̀̇͏̸̵̡̛̗̩̮͎̦̲ͅf̸̸̛͖̝̥͖́ͫͥ̍̐̿͢͡i̧͕̲̞̻̺̬̗̗̯̖͚͉͓͚̗͎̖͕̺ͦ͂͌͑̂̓ͥͨ̑̂͐̒̅̌̽̎͆̕͟͠n͊̅͂ͭ҉̴̖͈̥̣̙̭͚̞̞̬͇ę̤̖̞͐͂ͫ̓̋ͫͯ̾̄ͭ̚͝d̸͊͋̏ͮͩ̎́ͦ͌͌͛̆̋ͨ̿͑͂ͮ͘҉̡͓̼̻͙̜̩̕'
   
   
   YOU HAVE W-
   An error has been detected at: /home/ubuntu/workspace/AnOrdinaryDayAtTheBrowningSchool/map.rb 
   line478: 'DLC' has been identified as a corrupted file
   
   uninstalling 'DLC'...
   
   uninstallation complete, have a nice day!
   
   INTERMISSION FIN
   
   Part 2 coming eventually...
   
   
                        """)
                        
                        
                        
  UNDEFINED = Room.new('W̏̍̑͌ͮͥ̾͋͛͏̱̹̩̱̭͓̜̯̘͚̥͠H̷̤͓̳̠̗̩͙̘̠̖̼̻͚͙͒̂͊̂̓̑ͥ̀͋̾ͨ̐͠͝͠Ỷ̶̶̟̬̤̲̩̰̘̣̪̻̮̗̈̅̿ͦͧ̑̒͗̈͊͢',
                        """
    O̵̭͍̞̤̤͕͑ͥͧ̀̈̍̑ͮͦ͊͛̊̃̀̿̐͊̎ͣ͘Ị̵̵͍̲͔͎̺̳̮̙̤̝͔͙̆́̍̎͗̂͆̓̑͌͛̈ͫ̑̽͑͐̑̕J͋̄͋͋͗̊̍ͪ̓ͥͬ͆҉͚͇͖̳̪̤̙̬͚͈̘̣̬̩̮̀I̹͉͓̙͒̅ͧ̄̓̑ͤ͘͟͝͝Ó̗̫̫̘̅ͥ̓̋͝͝ͅĖ̴̯͕̺̠̯͚͖̳̗̥̯̬̜̞̇̓̃̃ͯ̅ͩͪͭͬͭ̓̇͘͟͝ͅJ͔̜̻̳̬͗̀ͤͮ̈́̽̈́̊́͗̍͛ͮ̕͞F͈͓̥̗̩̎̈́ͯ̀͘Ą̠̻̞̞̘̩̹̠̙͛ͮ͑ͭ̓̾͆ͭĨ̻͉͚͍̺̞̹̳̬̩͕͕̖͕̹̞͈̍̋̀̍͂͗͐͊̚͢͢͠Ơ̴̝͈̗̬̦̳ͩ̉̇̎̽̅̿D̶̷͔̝͕̩̘̽͌̋͊͐͡S̡̾͂ͭ̇͆ͧ̍̓͒ͩͮ̎͛ͣ̂̚͢͏͔͚̙̞̙̤̤͢͝J̡̩̬̗̲̋͋ͣ̂̄͐ͮ̄̎ͭ̍ͯ͛̈ͭ̏̽͌̿D̡̻̘̜̜̪̗̤̱̰̹̠͙̍͂̎̾ͩ̉̏ͨ͒̈ͩͦ͆̕͠J̨̪̯̱͙͖̘̦̪͚̞̄̊̽̆̅͋͟͠͞Ḁ̻̣̠̖͉̣̣͎͕͎͎̫͇͇̖͎͉͌̐̿́ͨ̓͐͛̀ͫ̅̓̑͋̈͘͜͡D̴̡̻̙̺̥̮̗̹̪̙̐̒̒̄̂̐ͦ͋͋͂͋ͯ̋Ǎ͆̐ͩͥ͌̔̇ͦ̔́͟͢͞͏͈̘̘̦͎͖͎͖̝͔J̶̧̥̻͙͚͚̺͓̰̦̀́͐ͩ̊͒̚D̶ͨ̄̓͗̉̎̃̽͊̃ͯ̋̚͡҉̭̙̪̜̤͖̭̪̞̫̺̲̬͘͠N̛̫̭̥̠͕͖̪̗̟͉͉̟͈͙̮͍͕ͧ͌̇̽̏̽ͪͭ̓͊̓͝ͅA̢̢̠͕̭̽ͤ͆̄ͯͫ̀̚F̵̮͙̞̰̺̥͔͙͕̬̱̞̟͕̟͔̟̞͍͐͋͛̓̄̆ͪ̕̕K̴̄̏̄ͩ͊͏̵̡̟̼̜̳̘̙͟ͅJ̴̶̤͚̝͕̦͉͆̇̈́̔͛̑ͥ́̉̂̇̽ͫ͂ͣ͢F̨̪͙̯̲̹̼̻͙̺̦̿̃͒̈́́̔̐̾́ͅJ̡̢̣͚͓̝̰̪͕͓͎̖̜̟͚̝̥͍̼̊̿̾́K̸̴̶̹̖͚̩̰̙̫̗͈̪͕̀͗ͫ̌̇̔̈́ͧ̆̀̆̓̾͠F̓̾͊̓͐͒͂͌͗̌̓̃͞͏͍̝̼͙̪̥̙̹͙͉̠͇̻͜͞ͅJ̴̣̞̘̫̫̏ͤ̒̈̿̉͒̍̌̌͠F̴̢̧̼͇͕̖͚͖͔̥̯͍̯̼̭͚̦̹̲͆̀̉ͤͯ͌̑̓ͫ̇̈ͪ̔ͧ̋̌ͤͫ̕͘ͅͅŅ̵̸̳̹̩͙͚͉͈̹̯̞̱͖ͩ͋̓̌̐̎ͪ̇̾ͨͥͤ̿ͦ̍̐̈͞ͅF̡̥̯̬̙͕̤͙͚̘̭͙̹̯͉ͬ͒͆ͫ̒͂̅͠͝Ķ̶̶̩͍͓̗̲̼̜̼͉ͣ̅̌͒ͣ͐̆̎̅͆ͥ͜ͅF̵̵͖̙̬̩̪̰͔̝͚̤̖͔̜̭͔̬͈͓ͭ̎̉ͭ͢ͅD̴̠͕̥̜̘̞̮̫̫͚̺̤̻͉͕̤̬̾͛̎̿̈̒͗͑̇́͢͡͞ͅK̳̙̗̫̟͔͓̲͕̘͔̰̙ͩͭ͒ͪ̓͑̌͐̃ͤͧ͜ͅJ͈̘̟̰̝̟̻̣͍̘̗̪̗͍̦̗̫̫͊ͮ͐ͣͣ̉ͪ̽ͥͬ̚͟A̴̛̲̬͍̬̺̜͉̹̖̞̠̯͙̜̋ͫ͛ͣ͌ͬͣͩ̓̔͌ͭ̏̌ͧ̄́D̸͕͉̺ͯ̽̒ͪ̂̊̀͒̃͌͆ͦ̀̇ͩͤ͛͛͘S͖̝̻͉̺̺̼͓̩ͫ͒̂̔ͯ̍͌̆͆̏̍̈́̚̕͠ͅI̵͍̰̳̰̲͉̥̹̗̩̰̙̣͋͌́̂̓ͭͮ̋ͬ̌̍ͪ̚͡ͅS̎̽ͤ̍̾̽ͯ҉̴͔̬̫̥̜̘̹̗̝D̨̖̞̠̥ͮ̓̓ͩ͗̏ͯ̒̄͞I̸̡̡͔̮̝̩̰͉̣̽̈́ͫ̒̊̋ͫ͆̇̅͐͜͝Ư̪̲̟̥͍͇͇̜͕͚̗̫̪̤̮͊͊̒̅ͦ̑͂̓̓͂̃̔ͧ̾̉͠͠D̴̵̛͕͉̩͔̠̜̬͎̪̦̣̬̟͍͐̾̽͌̄͛ͪ̒͑̄́͗ͧ͑͛̅̈́̚ͅK̡̹̖͍͕̹ͪ̓̿̐̊ͭͮ̍̄ͤ͌͑ͪ̍͗̓́ͥ͜J̷̷͉̝̝̮͖̘͎̰̪̤̩̙̥̜̱̟̮̘ͮ̉͌̇̿̊ͣ̓ͧ͊ͦ̎F̓̊ͪ̊̑̎ͩͯͣ͌̚͏̶̡̝͉̗͙̫̦̣̦̦͔̲̫͢ͅK̲͉͙͍̞̲̤̣̞ͣ̋̂ͨ̎ͨͧ̏̽ͧ̆̄͠͠͡Ĵ̨͙̥͚̝̻̘͎̺̖̥̓̄ͦ̏̌̚͟͡N̵͖̜̺͓̭̺̞̋̍ͩ͑̏̅ͬ͂͂̓ͫͬ̒̔́D̶̲̗͚͉̱̫̤͙̘͖̤̰ͭ͑͆ͤ̒̐̇̓ͨ͆͐̅ͬ͂̎̋͐́͟͟͞A̶̼̪̤̮̜̻̣̩ͬ̅͂͑̋̑̈ͫͩ͗͝F̞̜͙̟̳̫͕̬͉͔̪̎̐̏ͥͬͯͦ͘͢͟ͅS̷̘̰̠̹̱̲̼̣̜͓̠̠͑̒̃͗̈̄̏ͭͤ̒̂ͫ̔͊̂ͬ͝I͍̩̝̪̜̘̙̻̼ͦ͌̓̐̃̅̀͂͊ͫ̋́̄ͤ̅ͧ͘͡ͅͅJ̷̛̩͔̱̖͓̝̝̘̩̬̃ͩ̋̒ͯͩ͋̋̂̏ͬ̽͑̿̿͂͡͝ͅͅS͙̥̝͔̪͉̪͓ͥ͑ͯ͢͢D̸͑̂͌̉̉҉̷̤̪̟̘̙͚̜͈̣̭͍̻͝͡Ȃ̵̰̦̼̳̞͖̠̗̹̮͍̥͚͌̾̇ͪͯ͒ͦ̚͘͡͠ͅĮ̙̲͓̞̤̻̙̱̓́̎̆͢͝J͑̂̊͆̂҉̮͎̺̰͉̟̳̦̹͎͇̀́Ḑ̵̞͎̤̜̱̞͖͎͕͔̗͕̮̼͈͚͖̙ͨ̌ͯ̊ͣ̔͛͑̃͌ͦͥͮ̏͂̀ͨͯ́͜F̭̪͓̱͚̼͉͕̮͙̠͛͆ͭ̄͑͜S̼̯̠͍̰̯͔̥̪͖ͫ̀̅̊ͦ̑̏̆͗͊̎ͫ̓ͨ̃͘͟͝Î͖̹̯̙̿͂̿ͩͨͧ͡͡J̷̨̜̼͙̫͕̙̞̱͋̾̑̍ͯͨ͛̾ͬͤ̓̋ͮͦͫ̑͊͘͝͡Ụ̺̞̣̗̤̦̱̝̤̱͕̼̙͙̱͔̗ͮ̔ͬͮ̋ͩ̈ͪͦ̚̚͠͡Ḑ̛̩̳̫̱͕̜͇͓̯̪̺͉̺̙ͧͭ̈́̃͊̂͛͒̔͗̂͑̈͌̒S̨̻̣̺̗̦̰̲͊͂ͤͤ̆́ͤ̓̇ͬ̃ͫ͢Ḭ͉͈͈ͯ̈̍̿̑̍̊ͯͥ̕͢͢͠J̡̧͓̞̟̜̟ͪ͌̏̌́U̢ͧͪ͒̃͐̀ͩ̃̎̈́͋̓͏̡͇̝̳̞̫̝͙͔̘̦̜̹͢D̴̙͚̩̜̘͕̖̭͓̜̺̰̦̬ͬ̐͂́F̷̨͉̖̗̲̺̘̲͈̺̗̳̱̼̠̼͚͖͇͋̎̑̿ͯͬ́ͅĮ̝̩̦̙̅͗̎̽͛̅ͥ͛̈͊ͣ̍͋ͦ̓͂ͦ͝U͍̖͚͖̠̘̪̹̩̥̗̤̭͗͗͗̂͛̆͜͜͟ͅJ̡̳͇̗͚̍̈̎̄̅̀F̸̴̮͖̫͎͇͎̳̖͓̬̜̳̣̪̫̂ͮ͛ͤ̋͑ͬ̒͆́̚Ȩ̶͚̹͎͎̤͚͕̠͓̠̺̼̥̠̮̈́̂͛́ͤ̀ͨͧͨ̑̏̾̾̿̍͆̎̏̃͟W̗͈̞̹͕͚̹̟͇͇̼͎͇̾̈ͯͦ͐ͩͤͯͮ̍͝Ĩ̵̸̡̻̲͙͉̯̫͔̩̯̜͕͓͙̥͇̥̘̓ͩͯ̓͛ͫͩ͑͆͒̈́͌͟ͅU̧͓̺̹̞̻͖͚̥̭̪̰̘͎̺̞̪̭̪ͩ͆͐ͨ̑̽̂̂ͫ̉͆̒ͮͩ̐ͫ̒͝J̷̨̞̰̩̯͈̺̩̲̮̻̜̤͕͉̖̼̊̒ͭ̇̆ͧ̈́̄́͐̓͂̐͊̊ͥ͝ͅF͕̟̳̦̞͚̫͖̜̼̳̠̼̼̦̰̟͌ͮ̇͐͒͊͛ͯͥ̀͞͠E̡̝̞̗͉͚̽̏̀̓̂ͯ̐̾̇͛͐̌̀ͥ̔͋ͪͬ̅͟͠ͅͅͅW̴̶̛̼̫͔̜̦̺̠̖̹͇̙̞͓̓͛͐̔ͩ̽̀̆ͦͤ̂͌̓ͩ̽͞ͅͅI̷̸̵͚̮̖̼̔͛ͭ̆̓ͤ̈̒̿̅̽̚͞J̛̟̗̮̲̪̳͓̫̥̞̼̳͚͊̓̀̏̍ͧ̈̈́ͦ̐ͣͣ̀̕U̵͑̔͑̑̄͂ͦ́̈́̽̚͏̠̼̟͙̯̰͓̯͉̗̼̳͈̤̺͔̪̀͟U̸̢͈͍̘̠̼͎̘͎̜̺̳̯̪͛͑̉̒ͦͪ̅͂̃̌̂ͯ̿͢͠ͅI̐̒ͣ̅̎͌͛̓̓̆̏̽̇̀ͧ̂͏̛̝̗͉͖̼͖͕̙̞̩͎̬͖͖͚̩̬͉̯J̧̦̥̬̫̜͔̭̲̗͉̘ͩ̎̇͗̾̈́̏̊ͦ̌͐ͨ̀͡Ḏ̸̴̪̖̝͎͙̱̲̠̲̟̼͓͔̒̆̑̀̀̿̾͂̅̒̂̊ͦ̽̂ͩ̎̚͞ͅS̶͙̦͈̞̜̬͐̇ͫ͐ͣ̅̏̂̀̀̚̕A̴̷̡̬̯̙͎͕̥̰͙͛͗̌̄͐ͬ̽̇̔ͪͭ̍͝͞J̶̢͈͓̤̮̞̺̃̐͐̈ͬ̉̏̄̌̿ͫ͐͑͗̆ͮ̚͜͝Ủ̐̔̒͏̵̧͕̺̯͠Ǐ̸̙̰̬̣̠͓̗͙͉͇̻̦̗̽ͧ̿̈̀͠ͅD̨̧̬̜͕̫̤͓̘̱̭̖͍̞̘̱̩̮̲̲̓̈̆̓̃̍̉́̕S̢͒͌̈ͣ͐ͪ͑ͭ͐̍ͩ̀̃̏͊͐́͞͏̱͈̮̺̭̲̦͖̰̮̣̟͈͓̲͕Jͤ̀ͣͮ̆ͧ̐ͨͬͧ͗̏̆͌͠҉̠̗͔͙͔̙͓̭̦̼̜̰̣͘U̡̢̳̼͕͕̳͔ͣͨ͐͐ͫ̂ͣ̚͝͠͝ͅI̍̿̾̑͋̂̎ͬͩ̒̓ͤ̚҉҉̶͏͚̝̗̤͍D̨͓̹̺ͧ͗̄ͪ̓̀̊ͭͅF̴̷̤̖̜͇̼̲̦̜͚̹͖͌ͯ̉͆̂̀̿̍̉ͬͯ̄͑ͥ͘͡Ų̧̨̱͇̭̗͙͈̳̗̗̣̬̙̞̞͍̔̾́͐ͪ̾͢ͅͅJ͐ͫ̌̐̌ͣ̃͝҉͎̜̙̘I̺͇̲̖̜̱̯̜̗̗̰̩̞̗͉̩͇͎̺ͪͩ͂ͣͪ͊̓̅͗ͫͯͬͨ̉ͬ̌̚̕͢͢͢W̶̡̢̜͍͓̠̑̓̂̉ͬ̌ͭ̀ͧͥ͋̓̒̀̀̚E̸̛̳̙̳͔̓ͫ̈͆̑̑̌ͧ̇̓͆̐̀ͯͤͫͨ̀̚̚͢D̴̢͓̜̗̪͇̗̖̯̣͙̞̣̪͓ͬ̀ͣ̆̾͊ͧ̿̍ͯ͌͑̿̀̐̚͢͢ͅF̨̼̝̯̻̟͕͇̫̜͓͎͇͈͙̅̇̈̍̀̎́͜͝I̷̘̝̹͎̣̲̤̔ͭ̀̏͐ͫ͆ͪ̑̏͝͝J̴̮͙̺̱̟͕͉͎͐̊ͪ̀͆̐͡͡͡E̢̙̯̟͙̥̖̥̤̝̯̾̔̾͊͆̔̅͗ͯͬ͐̾ͮ̑̒ͩ͘͠W̥̥͈̺̱̮ͧ̿̈́̅̓̂́̀̚D̵̶̛̪̺͓̫̜̳̝͍̫͚̻̤̏̿͗ͤ̓ͥ̇ͅF̴̛̮̥̙̻͕͓͎̹̦ͮ͆̈̈́ͭͪͧ̑͋̕͝I̙̝͎͇̘͖̗̲̒͋̓̇͑̍̽̔̒̑ͫ̌̀́̚U̧̨̩̞̤͔̝̹̠̻͈͐ͤ̌̉̔ͯ̽̆ͬͤ͢͠J̷̷̡̧̜̭̹̖͕͓̭̦͔̖̯͍͌͌͗͑̎ͫͯ͑͑ͨ͑͛͠ͅḒ̶̹͉̗ͪ̓ͭͫ̽ͩͩ̃̾̊̔̌̉͊̄̎͊̀͋̕͘͘͠ͅS̡̺͕̜̱̘͍͚̩͇̱̝̥̠̗͈̑̈̑̂͛̄̃̔̏ͣ͡F̢͈̬̪̩̰͉͚̪͙̘͎̲̒ͩͬͧͤ͂̐̅̂͐̽̐̓ͯ̚͟I͋͛̔ͥ̍̅͠͝͏͕̬̜̦͓̤̟̹Ũ̴̡̝̱̞͔͙̠̟̦͚̹͊̌ͥ͌̔̅͒ͬͭ̈̏ͫ̓͌̀̀Ḋ̛̤͓̪̟̫͚̯̯͍̝̹̱̮͆̌ͥ̏̓̅̎̌͛̐͌͆ͬ͛̿̚̚̕͜͠Ḫ̷̵̢͇̟̜̼͇̙̫ͤͥ̒̅͗̀U̸̮͙̪̹͕͖̪̱̯̾ͭ͛ͬ̐ͬͪͯ͋͆̀̾̓̒̚͘͘͢S̷̢̖͙͉̼̟̜͔̤̥̜͚͓̗̭̙̬̼̲͎̄̊̏͒ͤ̾̊̓̎ͩ͑̄͛͌̅ͨ͝Ḑ̬̙̟̪͎͓̰͙͕̤̫̰̆̌̏̈́ͭ͌̑ͮ̒͊ͣ̕͡F̠͕̫͔͈̹̽̌̋͋ͦͣ̏̅̅ͨ̎͂͠U̴̡̻͎̠̺̱̠̲̦̯̰͆̈̊͊͊̇̃͆͂͑͆̈Į̧̞̼̺̞̱̰̤̤̼̱̘̹̙̦͔͈͗̓̾ͤ͆ͭ̒͂͢͝H̷̡̛̛̩̘̗̩̠͓̭̤̖̫͕̻̬̝ͨͦ̒̂͆͋ͩ̿̑ͣ́D̵̶̡̡̲̭̹͖̋͋ͣ͗̆͂ͪ̊͋ͅS̶̸͚̼͔̲͖̬̑͋̃̏̑̈̾ͩͧ̌ͨͪ̾͌̚̚̚̕I̵̠̰͇͚̬̯̤͉͎͍̝̤̋̋͂ͬ͐̑ͨ̔ͪͯ̅͒̃̽͝͠D̅̃̅ͥ̓̿̌͛̃͋ͬͧͮ̆̿͊ͯͪ͢҉̳̠̼̙͚̞͙͚̩̮I͎͖̘̲̟̩̪̣͕͎̣̺͂̉̇̐̈̄́͡Ṷ̼͕̗̟̺̼̤̭̜͍͖͙̪̰͍̖̹͛̑̈́́ͧ͋͑̌ͬͨ̎ͧ͂͆͗̀͟͟J̶̸̨̧̭̰̼̩̠͓̭͕͉̲̭̫̼͔̦́̎̾̈͆ͧ͢ͅͅF̢̲͍̠͚̩̝̣̣̗̆́̆͒͗ͪ͌̎̏́D̑̏̃ͬ̅̿̑͗ͬ͋ͬ̽̃ͯ̋̾̈́͝҉͔͕̼͚̥̮͡͠Ï̵̢̹̳͍̟͑̏͊̈̏͛̓̂͗͢͜U͋̒̒̊͗́͋ͦ̾̋̓̃ͦͮ͘͏̯̭͙̪̯̬̼̰̲̩͚̱͔̪̯̟D̵̸̶̬͕̙̰̱͕̦͈̯̫͔̻̟̙̰̬̰̑ͬ̋͒ͮͤ͜͞F̴̢̦̼̖͉̙̦̜͍̣̺̬̲͖̲̝̖͊̆ͦ͋ͪI̧̡̛̙̞͉̳͚̭ͪ̋̽̀ͥ̿̈̆͂ͭ̑ͥ̂͢͢U̶̡̢̬̣̦͕̪̾͊̓̒͐̓́ͭ̕͠F̶̛̹̲̫͇̪͚͕̹̌̎̿ͬͥ̓͒̈́̔ͦͧ͂͆͗ͫ̂̕͡U̵̴̳̤͇̹̦̔̀̀̄͊̒ͭͤͭ̈́̎͋ͦ͛͘Î̧̧͕̳̤̟̻̠̮̖̞͇͉̲̖̀͑̈́̌ͫ͛̈́ͪO̢͙͍̗̝̙̮̟̖̟̯͔̞̼̦͙͍̾̽̓̂̇ͤ̇̋̽ͥ̓̎ͦͤ͋̀͡F̍́̃ͥ̾ͣ͒̅̄ͤ̄̐̎̽ͨͧͯ͏̝͈̬͉̻͘͢͠D̴̷̺͍͈͙̤̱̙̬̼̪͕̗ͤ͐̃͗ͧ̈͊ͧ̄̅ͭ͑̾́̄̀̿̓͐͠S͑̍̆̔̃͋̍̉̉ͩ̓̓̑ͬ̕͏̨̘̤̖̺̳̙̠̻͕̬̗̬́͠O̷̬̱̦̪͔̤̤̞͔̔̍ͨ̃͢͜Î̳͔̹͕̹̼̣̭̗̟̌ͤ̆̇̀͞ͅJ̧͓͕̱̮̤͉̲̹̱͓͈͖͚̦̠̥̉͂̐ͧ͋͑̍ͫ̋̈́͛͊ͯ̃̓ͪ̀ͅƯ̓͑̇ͣ̆͗̅͜͏̤͕̖̗̹̥͕̮͎͔͍̠S̴̭̥̪͎̥̥ͪ̇̈́͠F̴̨̘͈̻̤͉̲͕̹̜͒ͧ͋̃̉͋̈́ͬ͞O̴ͥͧ̔ͭ̎͊ͮͩ̍́̕͏̙͓̝͓͜Ḭ̸̠̥̘͒̅̽̋ͮͬͪͮ́J̈̆̆̽ͣ̌ͭ̀͏̪͇̬̺̮D̵̸̨̫͈̫̻̰̼̂̽ͤ̏ͩ͢ͅS͑ͤ̊͒ͧͥ͂͐͏̵͇̣̖̖̳̝̝̱͚̤̮̪͙̕͟ͅF̸̤̮̟̺ͣ͂͂̒̄̃ͪͫͮ̐̊͊ͮͤ͂̌̽͗́O̷̷̶̱̼̫͉̬͕̒̑ͣ̋ͧ́̾ͨ͛ͨͤͅI̡̛͚̪̗̙̰̪̤̺̞̞̲̮͙̼̬͚͗ͤͯͤ̉̐ͤ̎ͪͫ͡J̡̘̞͙̞̹̯͉͔̤̙̥̳͙͙ͬͫ͂̃͐̀͡Ḑ̛̖̫̝͈͙̲͔̹̺͔͓͎̠̙̳͍͓͔̈̅̂̾̒ͯ͊̆̇̽͒͗̍ͭS̵̝͍͈̼̻͐̃ͭ͒́̀Ǫ̍͆ͦ̂̃͛̎̓̐̓̈́̎ͣ͋ͪͯ̋̊ͯ͠͡҉̫̩̗̠͈̖͎̞͉̗̦̫ͅͅI̛͗̂̋̄̇̈ͩ͛͒̾ͯ͛ͩͯͪ҉̜͚̮̟̙̭̱̺͝J̞̥̥̗̣̳͉͎̻̼̫̍͂ͬͪ̔ͦ̋̅͊̍͗̚̚͟͟ͅD͛̀̔ͨ̈́ͫ̆̓͐̏̽͒̇̚͏҉̢̧͍͖͖̗͍̳̭̲̣̹͙͍̮̬̼̤̳E̵̮̺̣̩͔͙͇̖̝̮̗̜̯͍͒ͪͤͦ̾̍̌ͯ̐͐̇ͫ͋͡Oͦ̊̃̔ͭ̿͐ͮ̈͑̉̃̿̈͐͏̺̤̦̭̞͚̤̫̺̭̤̞͎͖̪͔I̸͆̅͋͗ͦ͛ͬ̑͑̐̚̚͏̫͕͙̰̘͇̞̹̤̺͍̤̭̫ͅJ̷̜͚̥̭̪̰͓̟̉ͧ̉͛ͬ͌̃͂ͯ͒͑͆̊̃̽̍̍̈̅͠O̸̢ͦ̋̐ͯͭ̄ͭ͏͉̰̪̼̮̞̹̩̱̬͕̣D̶̨̡̻̯͚͖͛ͬ̃ͧ̃̂̾̀E̊̄̉͆̾̇̈́ͪͬ̏̾̈́ͣ͊̆͊͟͠͏͇͇͎̠̤̞͉̦̣̳̠̬̪̻̝̮̫̥͍͞S̵̵̢̝̻̰̯̥̻̳͓̠̲ͦ̍̓ͥͥͥ͛͛̎̇ͦ̉͌̈F̘͕͕̭̙̘̞̣̪̖͈̩͉͚͚ͣ̃̔ͧ͑̊ͯ̆́̏̓̐̚͘͞F̡̤͓̱͉͈͇͙̦̀͛ͦ̐̈͑͒̽ͭ͂́O̷̵̥̲̪̥͍̠̪͓͈͉ͭͩ̇͠͡ͅİ̵̢̦͓̗̹̘̲̤̦̬̘̲̼͖̗̠̱̃̾̇́͐͢J͇͕̗̌̈́̊̂ͫ̓̃ͦ͊ͮͭ̔ͦ̆̌ͦ̑̄͗͝͞D̵̖͙͚̭̫̱̠͈̝̱̟̥͍̘̳̩̞̐ͯ͆̋̉̕Ȩ̛̝̺͍̙̦̩̟̞̱̝̣̯̺̙̤̞͈̲͋̆ͭ̒͢͜F̺͈͍͙̥̟̰͖̰̳͙̗̭̭̯͔̼̼̆̓ͪ́̕͟O̵͈͙̳̪͓̲̠͈̬̹ͥ̆͗̌̍̽̄ͬ͂̈̈ͤ͑̚͜͞͝Ȋ̸̴̫̺̬̳͓̜̹̘̲̜͚̍̀͂̔̌͒̂͂͒͐̅̄̚͘ͅͅJ͚̮͎̯͚͓̲̟̟͕͚͉͉͎̟ͨ̓̊̃ͯ͛̿̀́ͩͮ̃̋̈ͭ̂̈́̚͟͜͝W̴̡̧ͩ̓͋ͫ̊̊̐̃̔ͨ̃ͯ̀ͬ̆̀̇͂͏̱̲̪̟̺̯ͅẼ̡͍̥̣̱͙̘̹͕͈͖͈̳͉͓̣̼͆̿̂̊̊́͜͡F̢̢̔̃̈̾͐̕҉͙̞̲̺̦͕͕̼̙̣̣̻̜̣̦̼̭Oͥ̽̆͗͂̆̎ͩ̌͌̍͊͟͏̷͕̳̗̫͎͡I͗̽ͣͮ͐͑ͩ͞͏̴͏̦͍͉̱̮J̧̡̱͍̟̺̲̟̜̟̰̪̩̣͕̟̦͍͕͙͆̄̾̐͒ͥ͛́ͦ͑͜W̵̟̹̼̞͓͌̎̀͒͡E̸̯̙̪͉̜̳̺̰̪̞̳͈̦̞̣̦͖͈̲͌ͨ͊͒ͦ̓͒̀ͩ͑̉ͤ͆͒̚F̧̭̹̱͙͈̙̫̖̞̻̱̲̲̥̣̉ͣ͛͜O̵̡̩̟̙͔̠͎ͮͩ͐̉͋ͩ̇͂̓̔ͪ̈́̉̂̌̍̏ͤ͒Į̵̛̻̖͇̳̰̦̫̆͐ͬ̽̉̓̾J̶̶̝̗̘̫̽͌̓͐̕͡ͅW͛ͩ͑̍̽̆̏̂ͭ͋ͦ͏̧҉̵̙̗̖̤͙͎̦̩͇̹͇Ȩ͖͈̲̻͕͙̯̮̝͙͎͓̻̇ͪ͊͋̐̆ͧ̈͘F̵̶̢̩̺̮͇̘͍͚͉͕͉͙͈̤̯̣͖ͨ̀͑͆̿ͩ̎̿̈́ͪ͑̚O̴̴̢͉̰̞̩̩̺̦̓͂͊̄̓͗̓ͭͭI̬͇̘͙̼̗̭͓̰̺̱̞͙̼͚̻̳ͣ͋̈̆ͨ̒ͫͨ̀ͨ͊̀́͢͠͞J̳͕̪̼̮̖͍̮̗͖̘̯̲̾ͫͥ̓̒ͣ͂͒̄́̀͘F̛͙͎̳̖̥͎͇̤̙̂̇̃ͦ͗̔͐ͥ̅̓ͪ͆̇̾ͭͪ̑ͪ̕D̶̵̡̟̥̦͙̪̗̮̤̖̤̒̊ͦ̀͟͜Ǒ̶̺͙̜̝̦̱͙͎͉̒̽̔̂͑̎̇̋ͧ͐̀͛̚͘͜ͅJ̴͚̝̙̘̱̜̪ͣ̓͐̄ͫͮͤ̃ͪ̎̔ͪ́̚͢͡I̵͎͕̥̰͍̞̞͍̰͒̐ͩ͋͒͟͟F͖̰̝̭̣̙̹̥̱͍̘͉̥͕̀̆͋̿̊̕E̛̐ͪ̔̍̏̔̂̄̾ͮ̈́̇͏̩̥͔͇̙̥̤̝̺̟̙̦͎͘͞Ẉ̭̻͖̻̳͎̪̰̰̝̑ͥ̌̊ͨͦ̈̓̐͗ͬ̉ͯ̽́́͠͝ͅO̶͈̙̤͔͌ͦ̏͆͗ͮ̓ͨ͆ͧ̈́ͨ̃ͧ̉ͯ̾ͩͅÏ̦̥̬͚̩̝ͣ͋̂͛͒̐ͤ̍̀J̴̶̷͈̼͎̜͎̳͓̹ͬ̉̂́̔ͤ̅̏͑͌̈́͑͌̃̒̊ͪ͢ͅW̷̼͍̥̟̹̝̥̩̮ͤ͗͐ͧ̀͢ͅͅF̡̘̱̟̗̈̓̈́̋͌͋ͣͦ̅͊ͩͣͦ̈̊̽͟͞͠O̷̖̥̼̲̫̯̦͙̙ͮͫͧ̊̽̊͒̆ͬ̊̅͂̽̊̇ͫ͑̊́́͘I̧͖͙̭̯̫̥͍̮̦̞͎̗̖̺͉͚͔ͭ̏ͬ̉ͬ̐̔ͫ̓͛̃́͜͝J̟͇̟͙̭̯̺̭͓̳̤̲̞̪̙̎ͪ͌ͤ́͜͟͢͢S̡̓̔͂̂̏ͯͬ̂ͮ̿͐̓̑̿̚҉̢͇̦̝̤̝͖̲̖̮͈̠͖͇̹̫̺̤̞D̵̡͎̪̫̼̳͈̠̘͙̿̔͆̿ͦ̓ͮ̾͊͊̐̚F̧̼̳̯̘̤̹̟̼̦͉̙̝̰̫̤̬͕͚͖̓͐ͧͨͮͥ̿ͩͮͯ͢Ȫ̸̧̔ͧ̑͐̂͋̒̀̇̀ͩ́҉͔̬͕̤̘̕Į̵̷͔͙̹̗̦̟̻͔̺͎̼̗͔̼̬͇̼̝͋͗̍̏̓̃̍͆̎͐̇̏ͨ̀ͅJ̡̇͛ͧ̓҉̷̟̱̭̩̜̮̼̝͇̩̳̥̼͜͟S̮͓̝̻̱͙͇̾̓̑̓ͪͭͤ͗̆͒ͪ̾̾̈́̓͌ͩ͞D̓̎̏̃̀ͯ̓̉ͬ͛̋͋͂͐ͫ͋͏̢͕͖̭̱̺͚͟͠F̷̢̼̥̻͚̬͕̩̞͎͌̓̅̄ͭͥ̓ͧ̔̋ͯͅỌ̴̩͇̖̤͇̯͉̟̻̼̭̖̘͚̤͈̱̙̏̅̇͂͒ͭ̎ͦ͂ͩ̔͢͟Ķ̶͚͔̬̟͉͓̮̪̬̩̹͙̻̘̖ͤ̈́̋̔́ͅÇ̲̥̝̯͇̪̙͔̻̠͇͈͕ͯ͋͑̆ͤ̊̎̾͋̿ͬ̎́ͫ̽̈́̈́͟͢͝ͅD̢̡̛̗͉̲̲̳̗̠͒̉̄́ͦ̎̅́͌͊̑̚͡K̶ͭ̈́̈́̄̚͜͏͚̼̻̝̝Ě̵ͫ̓͑̽̒͂̄ͥ̈́͝͏̟̩̗̺͙̰͝W̛̭̬̩̬̤ͭ̋̈́̎ͬͬ̓ͭ͛̃ͣ̓ͧ̐̒́̕͢͞K̼̝̲̩̘̪̦̲͈͕̹̺̖̟͇̩̑͊̆̎̐̿̿͛͘͟͜J̱̖͙͈̰̹̬̲̗͂͐̅͌̑̈́̃̃ͬ͘͠E̛͉̗̪̼͒͗ͣW̧̠͇̯̗͇͕̲̺ͬ̓͂̌M͛͆͛͊͊̀͏̨̢̬̹̱̪̪̩̮͚̠̤̣̗͖͈͜K̄͋͛͊ͬ̽ͪ̚̚͏̢͏̻̭̺̘͍̥̖̫͇̟̠̘̤̗̠̻̻͡ͅͅW̦͍̫̫̥͎͍͔̘̫͍͙̤͌̄ͮ͊̅ͨͪ͟͡E̢̧̛̟̻̘̥̱̜͚͓͇̞̗̤̝͈͎͚ͣ̽͒ͩ̇̀͢ͅF̧̛͚͉͔̜̝̬̝̘́̄̌͋̿̏͊ͮ̅̈͌̑ͣͬ̓͒̏̔̕͞K̢̋͂̎͌̓̓̑ͥͬͦͭ̓̆̒͞͏̡̩̦͙̮̹͕̹̲̻̭̲̮̼̼̻̬ͅJ̷̶̧͇͔̞͑ͫ̋̂́́ͅC̸̰̻̮̘͔̪̰̦̣͍̻͈̞̾̈̿̋͒͝D̥̼̤̖̫͚̳̘̹̰̤̩̜̬͉̓ͧͤͧ̔̈̔̂ͬ̏ͯ͊̚͜͠͞Sͩ̔͛͑̽͋̊ͭͤͧͬ͆̌̍̀̇҉̴̺̹͚̦J̵̵̛̳̣̺̹͍͈̱̤̩̋ͭͤ͊̀͠Ỉ̡̡̦͖̤̹̜̗̗͙̦̜̣̝̪̬̳̳͔ͧ͗̈ͪ͑͗̿ͮ͞ͅO̵ͣ̆̉ͮ̀͐̾̆̍̽̀͏̮̬̞̗̫͍͔͞Č̨̧̪̹̣̫͓͈̼̥̮̙̤̖̳̦͚̪̻͉͛ͦ͒͗͋͊̾ͪͤ̆̕D̴̢̨͚̭̙̺̝ͬͯ̾͋́̑͆̾̃̄̕Ŝ̸̩̱̼̜̺̱̤ͪ̑͌ͯ̇͢͜͝ͅÕ͐͗́̄̿͌͛͟͏̡̹̣̠̳̙̬͓̬͜I̶̛ͣ͊ͥ͑ͫ̐̍̉̊̽͊̈̍̚͜͏̛̹̦̻̖̦͕̹̜̩̬̲̤̗̺̟͕̞J̡͔̝̤̯̱͓͚̳̠̜͙̙̊̿ͦ̈̃̽ͦ̎ͫ͛̌̽ͣͣ̑ͣ̆͝ͅE̶̡̠̟̫͈͖̳̮̘̦̖̟ͬ͗̿̂ͤͩ̚W̸̧̨̹̯̗̰̗͈̬͖̹̗̘͎̲̼̟̫̰̮͕ͩ͂̋̒ͭ͒́K̸̡̨̞͈͈͇̖̈ͤ͋̎͐̚͘͘M̈́̑̑̒̉̏҉̷̢̹͓̯͖͚͉͕̤̲̺̯̼͚͈̦̙̫͡͡ͅĘ̛̯͓͖̭̹͔̲̤̣͔͓̪̥ͨ̓̅̑̌̀̂͌̍̐̚ͅW̵̛̥̬̳̦̝̋ͪ́̓̉ͭͥ̑͌͌̾ͨ̔̐J̢̛̩̙͇̥͓̖͙̤͇͉̜͓̫̾͒̌ͧͬ̒̃͂͛̀̌ͧ̂̚͟ͅD̅̓ͭ̎͂͋҉͎͚̹̰̫̬̘̬̜͡ͅS̨̢̄̿͛͒̏̊̓̾̎̈́̐͒̂̊͜҉҉̲̠̩̪̜̫̝̺̞ͅI̸̧̍̓ͦ͊ͭ̇ͧ̀̿ͮ̀ͤ̇̾̈̔̒̈́͠͏͖̫̤͍̮̺̮͈͖̩͈͈̞͍̻̟J̸̅͑̐̒̔͆̽̏ͪ̿̿ͣ͗́̇̈̑̃͌҉̷̨͓̲̩͓̗̣͕Ů̡̜̭̣̗͎̭̬̓͊ͮ͋ͩͯ̿̿́̌̓̊̚͠D̙͈̱̗͇̲́̃͋̿ͯ͑ͭ̾͆ͦͪ̑̽ͬ̒͊ͧ̊͡͝S̨͔͍̱̞͉̙̯̺̪͉̯̏̃͂̂̿ͬͭ̄̋̽̔̒̾̕͘̕͝Ç̢̟̮̫͓͍͖̞̟͉̲̣̪̾̔ͩ̓̌̾̇̕͟͢K̴ͧͣ͊̆̉̃̈́̅̽̍͗̑̾̄ͣ̚҉̨͓̘̮͚̻̞̳̻̗̫̱̤͖̲̞J̸̷̧̙̼̻̤̲̪̟͓͓͉͍̫̫͂̽ͤ͆̎ͩͫ̔ͩ͊͊̀̾̈́̔̓̂͝ͅM̨̧̭̠̱̠̼̤̬̰͖̱̿̍̍̇̋͌ͤ̓͂͌ͭ͢͞͠ͅͅC̬̪̹̰͔͔̬̻͙̜͍ͫ̆͌̔͆̄͋̈͗̓̍̈́ͥ̀ͨͭͧ̚͡͡E̷ͪ̐ͫ͛ͭ҉̢̪̭͍̤̭͈̖̙͙̠̮̗͕̬̹͉͓̱̜͠W̵̎ͦͩ͘͢͏̷͍̹͓͔̼̫͇̬͕͚̮̰͎̹J̑͑̉͊̃́̓̔̿̌̚҉̧͍̗̮͓̥̞̜͠ͅĮ̌̉ͪ͊̊̓͂ͦ͋ͣ̆̒̋̅͗̀͜͏̱̲͓̲̖̖͙̣͙̺̝̙̳ͅJͧ̔̂̏̆̅͂ͧ͒̍̈ͭͩ̀͗̄̑ͦ̏҉̜̹̲̟͢K̽͊̊͌͐ͥ̓̋̈́͑̂̅͐͊̚͝҉̡̜̥͚̗̙͎̙͖̺̟͎͇̮̘̀M̷̛͇͉͕̫͈͖̬̪̠͍̥̳̒̂́̔͂ͣͬ͆͗͂ͩ̇̆̓ͭ̊̚͢͠Dͭͭ͌̊ͪ̑͋͂̽̎ͭ̃͊͠҉̺̗̹͔̫͎̮̤̘͉̬͘͞ͅF̼̻̹̹̙̼̱̠͕͎͓̣͓̼̣̃̔͆͊͋̒̏̀̽ͯͥͪ̚͟͠ͅS̨̭̖͖͖̙̘̙̮̜̳̺͉͖͓͔̲͙͎̎̂̈ͣͥͥ̾̇́ͨ̐̏ͪͪ͘ͅI̵̧̺̥̭̰̦̰̗͉̜͖͗͂̄͆̈́͂͐̒̿ͧ̐ͦͥJ̸̰̭̹͈̯̟͍̻̮̬̜̱̥̗̐̉ͭ̌̈́̍ͦ́̃̕͡͞ͅÌ̸̽ͤ̉̂̓̆͛ͪ̇ͭͪ̈́͛ͫ͐͊̆̀̚͘҉̸̳̦̫̼̦͎̣̭̤͕̥̥ͅD̴̥̼̞̲͔̖͓̰̮͎͚̹̝̙̑ͨ̾̓̈́͑ͭ̆ͫ̒̚̕͘S͂̆ͯ͐̇͐̐̐̚͏͇̰͈͉̗̲̺̻͎̗̝̩̺̜͝I̧̡̤͎͙̟͎̗̰͍̮͎̘̘̲̰̫̝̻̻ͮ͆ͯ̏ͪ̒̉̀̽̍̚̕͝ͅJ̨̨̳̬͈̟̯͈̻̞͔̘ͣͣ̉ͮ̿̈́ͫͯͧ͌ͧ̋ͤ̆̕͜͠E̅̍̊͑̊͛͌̾͊ͩ̐̎̆́̕҉̷̯̟͈͓̩̙͇̝͍͔̟͇̤͍̜̬͉̯ͅW̸̸̲̱̙̫̅ͬ̎ͣ̂͌ͅM̷̸̗̜̰̦̮̪̘͍͍̰̣ͤ͗̈́͒́̕͘K̨̢̯̱̦̫̲̲͙̯̩̩͎̞̺̥̜͓͒ͫ̉͊̀ͣ̃͘͘D̎͑̿͆͐̅̄̀̒͐̈́͋̋ͩͫ̽͜͏̧̞̼̩͓̣͇̥̲̹̹̫͍̥ͅSͯ͊̆͒̒ͨ̽̆ͭ͗͆ͥͩ͏̷̼̰̼͓͚̯͎̟̫̫̳̙̀͡C͕̤͕̪̳̹̻̞̼͕͕̫̦̝̳͉̞̄̓͛̇͑͌̿͊ͨ̄ͤ̄̊͘͞J̵̧͍͚͔̣̣̉̌ͬͩ͗ͥͨ̏̑̈ͨ͟I̴̝̫̜̻̗͓͈̺͍̯̊͋ͯ̽ͣͭͤ̅̎̄ͨ̾͊͗ͣ̚̕͠͡U̷̴̗̦͇̘̮̟͚̠͔̮͕͈̾͑͂̿̇ͧ͂̏͘͜͡Ǐ̵̡͍̭̤̪͈̰͉̞̩̙͔ͬ̀͘͢ͅJ̶͗ͧͬ͊҉̱̫̱͕̖̼̭̀̕K̓̑̓ͭ̎ͩ͑ͮ̅́҉̨̗̯͍̦͖͍̯̟͓͍͕̻͖̰̀͢Ę̜͚͚̖̘͔̖̝̱͇̝̬͌̋͊͑ͧͫ͂ͮ̂ͫ̂̓͋̇̎W̴̷̛̟̫̮̼̼̖͈̍̈ͩͪ̒̚͠͠ͅͅF̡̧̧̓̔ͭ̽͆̀҉̯͈̲̼͚̭̭̲̙̰̭̱̦͈̞̤͓̼ͅĒ̢̡̄̇ͦͥ̉̑̀ͯ̑ͯ̀̅̽̓͝҉̫̱̮̗̲͕͉̜̬̣̝̠̻̲̫W̷̴̷̩̼̪̬͙̰̖̹̳̮͙̝̞̲ͣ͗̊͌ͯ̾̐̈́ͧ̀ͧ͜F̼̠̥̔̊̋͑̇̈̊̅ͮ̎ͣͤ̌̏̚̚̕͡ͅJ̵̯̱̝͇̞͓͂̎̎ͮ̍ͨͯͬ̏ͩ̏ͭ͂ͪͣ͌ͯ̆̇̀͠N̛̬̥̦̺͇͕̔ͣͤ͂̓ͨ̃͟Ę̶̴̷͉̬͖̙̝̭̩̬̦̠͕͕̭̘̗̥͇́̓̿̇̇̊̐̇̾ͧF̨͍̙̭̘̯͖͍̘̲͔̼̼̟͖̝̥̞̞͇ͤ͊̉̑̓ͥ͂ͩͣ͊ͫ͌͋͡U̷̶̷ͦ͗ͩ͋͆̂̐ͧ̍ͧͫ̽̐ͫ̓͜͏̼̥͓̭͉͓̯̦̬̜̹̗I̴̛̱̲̳̞̲͆̒̎̏̔̏̅͒̎ͧͩ̿͋̀Ḑ̿̋̊̔̅ͤ͂̿̌̑̿̎̅ͯ̔̿̃̚͡҉̟̰͎͖̠͖̬ͅS̖̺̻̳̯̱̳̘͔ͯ̐̃͑̋̆̔͆ͮͫ͌ͯ̋͛ͨͩ̚̕͜͞ͅJ̨̟̥͍̯̯͂̋͆ͣ̑̋͟͜͟͝E̴̴̯̼̳̯̱̞̫̺̥̩̭̱̙̹̘̠̺ͣ̆ͮͯ̒͒̌͆͆̀͝W̴͙̳̯̙͎͍̺͕͍̘͙̱̃͛ͧ̒ͯ͒̊ͥ͐̉ͪͨ́̕͟ͅF̄̓̏̐̔̀ͩ̌̇ͩ̒̋͟͝͝҉̟͇̠̩̜̱̣̺̱̮̞K̷̡̨̟̬̳̦̣̺̰͚̣̝̹͎͚ͩͤͭ͋̾ͭͤͮ̆̌͋ͭ̾̿̔̊̀͠ͅF̷̢̛̟̘̘̥͔̦̖̗̲́̈̐ͨ́͆̓̈͌̌̂̎̌͆̇̽̈́̃̚͜͞Ȩ̦̬̼̖̗̖̫̜̣͉̗͔̻ͪ̏͆̆̉̽̉̊̒ͮ̒̀͘J̸̲̤͔͈͓̭̳͍̦̼͎͎͆̑̉̿͊̕Į̶̄ͩ́́̽́ͨ̾̂ͨ͟͏̴͎̫͚̻̮̙Ḓ̶̱͖̖̭̳̺̗̞̳̯̥͎͚͍̝̺̭̲̊̿͂̅ͭ̍̈́̐̍͑̋̑̈́̾ͦ͆ͫ̍͠F̸̢̝̝̗̜͙͇͔̬̗̠̽̉͊̽̄͆̓͂̾́̔ͮͯ͌͟I̵̫̳͍̟̻̖̻̟̲̫̬͉͉͚̓̈̏̌ͦͬ̀ͩ͐̅̽̓͊̽̈́͘͠ͅF̵̛̦̫̩̹̯̝̫̞̜͖͙͉̞̦̫̺̮̻ͣ̾ͨͭ̊̄̑̀͘͜ͅŞ̨̛͖̝̣̭̜͓̥̳͇͈̜̤͔̤̺̝̀ͥ̑̓̋̿̿̎̚D̵̴͊̉̽̓ͩ̃̈́͛̉ͫ́̃ͩ̽̃̈͏̘̫͔̝̹͍̕K̴̶̷̡̖̱͔͕̼̞̥̙̜̾̎ͨͧͯ̐̄ͦͤ̇͑̿ͭ̃ͥ͊͌ͣͬJ̴̴̡̯͙̮́̏ͭ̾ͨ̈ͥͥ͐ͣ̚͜͞D̈͐͒̿̌̅̆̄͆ͫ̓̈́͐͗͊ͣ̿҉̴̛͇͇̼̫̬̠̞̤̗̲́͝F̪̪͍̭͚̥̻̣͉͖͖͎ͣͬ̉̎ͥ̉̋̄̉̃̉̓ͧ͐͋ͤ̒͟͜S̴̞̰̯̹̜̣̱̬̀̅ͤ̈́ͧ̈̕͠K̨̤̞̬̪͚̝͍̇̅̔̇͐ͯ̈́ͬ͗ͯ̽͋̈ͤͭͩ͝ͅM̶̵̸̷̛̱̯͚͔̜͖̰͈̼͉̘̝̩͇ͪͣ̿͂̽̉͂͗͂ͮ̾̎̓ͪ̂̓Ả̽͛̽̈́͗̓̈ͥ̌̊̂ͦͫͫ̈͏̩̦͓̼͇̤͎̪̰̗̬̖̝̣̺̯̯̳͝Ņ̢̭̰͎͙̪̞̈́̌͊̀͘͞ͅJ̶̛͖̦̦̪̱̹̙̭̭̲̩̠͉̦̦̲̭̰̇ͩ̈́̇͛ͧͤͫ̊̄Į̫̭͓͍͉̿̈̈́͌̆͋̊́̉͂ͤ̄͘͟͢ͅȈ̒͊ͤ̊͗͆ͤ͐͊͛̓ͭ̕҉̱̖͍̳̬̬͙̮͚͠͡Sͧ͆́̾̒̓̽̿̑̾ͧͭ̿̓͏̷̵̢͉̫̳̲̘̞̟͇͕̮̫̺͈̣͎͘Ḟ̨̖̯̦͓̹͖͍̰̫̝̹͍̰͓̤̜͍̊ͪͣ̒̂̏̑̀͝ͅͅD̸̡̺̘̱̥̲̘͈̲͇̺̠̻̓̾̓̕͠D̸̨̞̝͉̹͎̲̘͎̙̠̝̘̗͙̤͚̟ͪͣ̏͛ͦ͋́͊̊̌͆͒͊́́ͅI̢͚̘̘̘̠̲̤͍͈̻͓̯̳ͬ͊ͩ͌͋̄̌̾͐̈́̽ͩ͂̓̈͋͠F̢̨̙̭̮̝͛ͧ͐ͣ͘͢͞I̷̊̓͛ͣ̔͒̅͏̫͎̫͖̩̰͖͓̼̭̥͚͕̙̣̹̣͇Ǘ̜̟̬̜̦͈̳̗̹̾̈́́̚͡Ĥ̷̷̵͓͈̮̱̬̞̻̥͍͖͈̻̣̺ͮ̎͑͟ͅẺ̱̹̰̦̘̗̗̣͈͊̂́̿̀͢͢͢ͅF̛̝̗͎̺̳̯̮͋̄ͦͩͭ̑ͦ̾ͮ̎̅̑ͮͣ̂̀̚͝͠W̶̴̲̩̟̗̓̑̎͑̈̂̋̇ͭ̏͑͑ͯͥ͌ͣ͑̓͘ͅJ̩̥̥̫̬̝̣̮͇̜̩̪̞̹̽ͮ̄͞͠ͅN̵̬̲͎̩̪̗̱͈̪̭̱̠͂ͩ̆̄̐̐̏͛̈̎̉͘͠ͅͅE̡͉̞̲͖̤͍̺͎̼͍͐̊̄̊͒̍̿̉ͩ̀͢͝͡ͅF̙̫͍̤ͮ̒̀͂͛͌̑̈͂͆̈ͦ̑̏̕͜ͅW̨̧̨͎͉̻̬̣͕̮͙̠̫̦͍͎̭͉̠̰͇͎̉͂̇͂̏̿̂̒́̃͒̅̆̄̒̓Į̶̮͍̲̤̙͔̻̉ͣ̉̽̓͆̅͐̃U̵̫̙̯͍̫͇̝̱̺̍͆̅̄͌͂̚͟͠͞C̡̙̱̯̞̞̬̬̲̞̩̞͈͍̱̭̲̞̋ͥͤͩͪ̔̾ͧ̾̎͆͊ͬ̽͛̉̑̊͗͜ͅͅS̶͓͔͓̥̯̳͕̞̝̰͓̫̠̬̹̭͗̽͌̔ͯ̄͗̓̂̒̏ͯ̀̀I̷̢̱̠̪͕̪͎̬͎̼̿̍̇͐̔̂̄͂ͣ̋̐̈́̿ͯ̍̍͛̀͞ͅJ̛ͫ͑͆̋̀҉͕͉̩̟͕͢Nͯ̈́ͥͥ̒̀ͪ͗̿͌͏̺̥̠̘̻̩̥̟͖̹̥̪͖E̷͚̘͙̼̺̘̼̤̟̳̱͒̀̓͌ͯ̅̑̇̈͑ͩ͂̔̅́F̡͓̯͚̲̠͉̺̻͙̯̗̭̖̄̌͌̆̈́ͣ͂̉͆͊̃̏͟ͅW̼͕̭̜͓͚̤̰̑ͦ̎̉̾̆ͧ͜I̷͒͐̀̔ͬ̂͐͒̋̀̀̍͗͋̋ͮ̍͏̧̜͉͉U̶̧͓̟̟͍̲̩͕̹͈͊̿͆ͩͥ̐̓̌̇͂̔̌͋͒̑̉ͯ̍ͅOͧͫ̂̓̃ͥ̌̽̐ͨ̒ͨ̍͛̂ͫ̈́͐͢͠͏̛̞̗̜̥͍͓ͅȞ̵̢̳̺͈͓͕̭͔̯̤̼̼͚͓͚̝͎͔̦̄́ͬͥ͛͌̒͗̐̿̄̇̓́͟͞F̷̼̝͉̮̻̻͕̙̑͛̔ͧ̔̑̐̎ͦ͝͡ͅE̢̺̞̣̞̹̹̪̩͔͇̩̦͚̠͒͑ͫͫ̅̑̊ͨ͗͘W̵̡͙̮̥̥͍̻̺̖̝̣̝̺̱̣̰͔̜͒͒̋͑ͣ͐̓͊ͤ͑̒͛ͅͅŨ̓̉̇͋ͤ͐̏͆̈́ͫ́̚҉̮͔̜̯H̸̛̭͙̗̜̳̟͕̬̩͈̜̣̰̮̼̍̓͊ͣ̈̍͛̀ͧ̀ͨ͒̇̍̄̽̅̂͡O̡̰̖͇̤̣̦̗̣̣̼̟̲͔̭̣̫ͭͩ̈́͗͗ͥͩ͘͡͝ͅͅF̨ͣ̈ͦ̿̏̋ͩ̎̌̈̐͂͋̓ͬ͝͏̴̧̼͚̮͉̙͍̮̣Ȩ̧͇̭̫̪̩̬͎̣ͧ̃̋̈́̆̏̽̊̆ͥͥ̾ͤ̊ͩͫ̕͞U̶͇̹͙̪͒̎ͧ͂̿͊̽̏̽̍̑͑̿̚͜͢H̨̛͋̑̾̈ͤ̃ͯ̒ͪͭ̀̉ͫͥ͐ͪ̓͢҉̱͚̦̫̙̻̼̦̱̝̹͍̰͈ͅİ̵̵̴̷̘̘͎͕͔͓͍̘͕̤̝̯͎̫̦̖ͪ̏ͧ̂̆͆ͨ̔ͅF̢̛̣̮͔̝̣̗̯̥̘͔̳̤̙̂̿̓̒͑̉ͭͭͬ̒͘͜͡ͅͅR̷̢͕̺̖͕̖̹̮͔͍̥̞̜̻̱̻̳̔̈́̈́̂ͩͤ͋̇̈́̎̀͛̑ͦͩͤ̀ͅG̵̤̳̮͇͔̩͕ͪ̅ͫ̄ͮ̎̒̀ͅH̷̷̻͙͕̯͚̳̱̦̭̪͍̮͖̣̭̬̻̘͙̅́͊͌̑ͥ͑̃͆̔ͥ͡͡Ư̓̈́̍̊̾̃ͦͬ͆ͥ͆͆͋͆̋̏͆͏̛̯͙͙̺̳ͅR̸͉̺͎͈̜͖̗̜̹̦̯̲̳̫͛̿̊ͮ͂̍̿ͫ̊̐̒͛̅͋ͤ̍ͫͧͯ̀͡W̷̸̴̮̪͍̳̹͚̪̹̼̓̌̽̓͒̾ͧ͑ͨ̀͠G̶̡͋̓ͯͧ́ͧͮͧͥ͐͆ͪ̽ͥ͂̆͒̚͘͏̡̬̜͍̫̲͓̺̱̰͙͉͕̞̞͈̩̟Å̷̘͇̼̟̺͎͈̞̭̞̤̗̺̳̻̜̒ͣ̎ͭ̿̅̌̈́̋͛͘͟U̢̔̍̑̽̽̚͢͏̴͉̟͉̯̹̭͔̣̩̠͓̥̖͓͞Y̴̵̡̮͈͙̼̠͈͈͖͍̺̝̙̫͌̂͂̑͆͐͂ͩ͐ͬ̒̉̅̎̓͋̅̀͢ͅH̷͖̫͚̰ͯ̉ͮ͌ͧ̓́͘F̶̶̠̼̗̤̖̬̲̗͕͓̜̱̔͒̽ͦ̎͗̈́ͧ͊͜͡Fͯ̌̒͆̂ͩ̈́̏̿̍͘͏̡̠͙̤̬͝͞I̛̤̼̹͙̗͔̩̮͓̗̰̠̬̠͉͕̦ͬͩͤ̐ͭͮͩ̈͋̑ͫ̏ͮͩ̄ͥͩ͛̅͢U̵̴̪̱͔͇̼̮̜̖̖͔͋̌͗ͨͯ̆̀͊ͧ̀ͧ̏͑̃͘͞ͅͅH̵̦̤͚͔̎́̋ͯ͝F͈̤̙͙̦̩͔̲̩̐ͭ̇ͤ̆͒̈̿̚͞ͅͅD̓͊̋̈̿̋ͫͫ̈́ͥ̾̽͌̔̀̽ͯ̕҉̮̯̱͖͔̗̖̝͔͢͠K̻̱͚͉̗̘̦͚͇̣̎̎͆ͪ͗͐̏̏̎̏̾ͭ̓̾̀ͪ͠J̸̨̢͓͉̲͎̪̞̎ͭ̒̑̔ͭ̃̔́N̵̏̔ͨ̽͐̏̊ͤ͏̧̺͎͔̪̜͓̩̰̪͞F̶ͩ̀̎͋ͦ͒ͭ͑ͬ̓̾̃̿͢҉̱͙̳̞̻̤̱̣̭̣͜W̷̵̲̼͕̫͙̞̠͇͒̅̍͗̋̑͂̆̾́͡͞R̶̡̘̘̠͇͕̩͓̲̞̘̰͇͍̫̹͙̣̉͆ͦ̑̄̌̈ͩ̄̿͛͞Ę̡̼͖̦̠͉̼̘̂ͣ͌ͧͣ̀́ͮͭ̑͛͂͐̏͜͞ͅA̷̴͆̈̅͗̾͆̌̈́͊ͪ̔̒̾ͫ͒̔̅͟҉̱͓̼͓̯̪̬͎̖̯̠͍̬̭͕ͅK̡̞̬͈̮͚͚̐͊̿̔ͤ̽ͦ̉̑̀J̨̩͎̫̹̖̱͇̭̣̫͙̭̫̥̘̘͙̥͒̄̎̓̔͒͊͜N̜̠̳̹̼̘̳̘̦̜̳̦̙̞͓̫̣͂̑͆͆ͦ͜͡W̶̴͈̹̩͎͉̮͙̪͙̩͖̻͖̱̗̟͍͓ͯ̾ͪͮ̾̿ͦ͐ͥͦ̾͊̃̀̀ͅE̸̷̪̦̻͎̙̲̱̯̗̤̲͈͖͐ͯͩͨ̍̋̊͟͜͠Ḩ̪̹̞̭͎̳̲̱͉̱̜̹̙̤͊̒ͬͭ̏ͭ̊̋͟͝͡͡Y̧̖̺͕͚̜͙͓̤̟̟̲͑͊ͥ͗̑́͘͜͜F̧̬͍͚̪͓̫̬̼̯̊̅ͣͣ̋̐ͬ̆ͮ͟ͅȨ̅ͯ̓ͯ͋͂̉̈́͐́ͭ̈ͩ̐̾͠҉͍̪̭̹̙D̙̭̮̥͈͍͈̐̄̌ͫ̾ͤ̊́͠U̹̗̮͚͙̪͇̦̝̤̰̽͛̍ͥͫ̉ͪͦ̊͗̂͒̄̿͋̀̚̕͠I̧̛̩͕͔̝̺͎̪̟̲̰̒͆̎͗̈́ͣͭ̒͗ͧͅḨ̨̤̖̦͔͔̠̪̤̥̝̬͖͗̇̈F̡̤̲̫̰́̎͆ͩ̍͋̒ͯ͗̏̉ͩ̅͛̽͋͘ͅͅE̶͛̓̽ͦ̆̓̇̃̾͛̊͊ͨͯ̾̐̽͘͏̝̜̰̘̗̥̼̱̺͍̗͚̞ͅW̧͍͓̩͕̣̻̼̤͈̘̬͖ͫ͌ͩ̔ͧ̃͗ͥ͌̍ͤ͑̓͠R͕̦͈͍͎̩̦̝̹̰̲͔͚ͦͭͫ͐ͧ̑̔ͯ̆̃ͮ͋ͫ͋͊̔̀͟U̽̉̒͋͒̉ͤ͆̈̉̈́͒ͫ҉̵̶̧̗̮̼̼̬͖I̸̢̭̯͎͉͚̰̬͙̦͉̥͙̜͈̯͑͋̈͂͂̒͑̑̿ͫ̒̚̚͘Ḩ̬̭̳̗̩̤̖̫̻͇̞̜̘̮͙͕̤̽̾̍̆͛ͯ̑͛͐ͫ͋̉́ͅY̧̛̻̪̱͚̱̞͍̫̱̾ͩͮ̊̋̐́͘͟F͊̋͒ͪ̅͆͑͋̃̍҉̹͓̥̯͕͎̞̞̠͕̝̺̘ͅ8̹̯͖̺̦ͦͬͫ͂̄̑́7̸̡̢̛͙̞͍̯̤̹̼͗ͬ̔̔̈́͑́ͩ̾ͫ̓̉̈́Y̸̢͉̝̗̙̥̑ͯ̈́ͤ̾̉ͤ̑ͬ̾ͣ͐̉͌̀͜͝Ḟ̴̰̘̮̤̣͔̝͖͖͉̮̪͉̯͙̿ͥ͊̅̑͟E̵̱̺̟͉̩̼̼̺̺̥͋̀͒̍͐̓Ẅ̢̹͈͉̬̦͚̬̹̭̯͓̩͚̮̖͙̣̏͌̿́̓ͫ̃ͪͪͥ̓͆̏͑̊͘ͅŲ̣͎̘̝̰͈̱͔͔̔ͫͦͭ́̑ͫ̌̉̄ͥ̆͛ͯ̐̚͟Y̶̴̡̛̱̭̣̘̱̱̘̯̩͈̗̠̬̲̏͋ͭ͑̌̿́H̙̫͈̼͉̘̫̫̖̬̤̫̫̗̙̦̍̐ͫ͂ͦͪ̎̊͌͂͌ͫ͜͝F̢͓̮͉̤ͨͬͣ͋ͯͭ̄ͭ̈́ͫͤ̽̉ͪ̐̈́͟͝E̵̴̦̩͔͍̜̳͈̭̯̣͕̜̰̺͇̪̘ͫ̄͛̏̍̋ͣͮ̏̄̂̾̌ͥ̏ͪ͠W̵̮͕͍̫̱̳̩̜̯͛̆̒͌ͤ̽̅̈ͮ̂ͯͤ́͢͡R̸̡̧̗͙͎̰͎̟͓̬̼̬̮͔͕͖̰͊͌͐I̋͑ͣ̈͐̔͑̚͝͠͏̰͚̤̯̙Ŭ̴̢̫͕̹͇̭̯̥̍ͤ̑̐ͭ̅̆̇̅̋̍̀͋̊̃̈̆̀R̷̼͔͉͓̙̣̪̭ͥ̅̄ͧͪ̿ͯ̀͘͜Ę̸̗͓̘̼̮̥̮̹̦̳̣̮̪̞͉̊ͦ̽ͪ͊̃ͮͮ̊ͤ́̚͘W̷̸̡͙̲̯̗͕͉̹̫̠̰̘̰̥̳͇̱̰̖̓ͪ̎͋ͥ͞Q͆̊͗̿̅̂ͬ̄ͩ̊̂҉͕͇̘͕̗̦Ị̵̷̡̥͇̬̱̱̗̝̻̣̣̭͂͌̎ͤ̌̍ͧͯ̉ͧ͋ͫͤ̇̍͆ͯ̃̕͡Ū̯̖͖͓̬̰̩̲̪͔̲̞̽͊̎̉͐ͣ͗̏ͮͫͦͫ̇̚͢W̷̮̩̘͈̣̟̦̲͚̦͉̹͙̝̭̩̋ͫ͛̎̾ͦ̿͊̎̍ͪ͗͛́̚̚ͅͅË̷̢̜̻̳͇̘̝̠͍̪͉͇̠͔̼̄̓ͭ͒́͆ͦͫ͌ͫ͌̆̅̿̽́R̿͂ͧ̏̐͂̈́̊̅̽̕҉̰̩̬̥̙̫̟̯I̵̷̴̢̬͙̯̖̠̫̼͍̣̬̘͇̘̱̰̘͙ͧ̏͆̒͌ͧ̇̌͛̇H̢̭̮͔͈̦̠͔̦̼͕̥ͬ́͛̎͐̅͋͆̈́ͬ̈́̚͠Ų̺̠̭̳̙̙̳̻̩̬̝̺͎̻̳̦̅̊ͣ̆ͦ̑̐ͪ́ͭͬ͑̈́̆̚͠ͅͅW̢̧̛̮̰̙͚̥͚̹̰̮̻͚͔̘̭͙͖̗̦̮ͥͬ̀ͣ͌͋̇́͡E̸̷̸̻̹̣͈͚̳̬̻̣̟̲͖̫̪ͦ̿̾ͧͨ̽͋͊͌͑ͭ͋̏̋̋́̓̀͞ͅR̷̆͐ͬ͌͑͏̷̻͍̪̤I̸̸̻̘͔̪͇̦̘̿̄̄͐̈́̔ͭͫͤ̆͂̀͘͘Oͮͫ̈́ͪ̀̚҉̝̫̠̦͕̟̖̼̘̙̟̞̬͖̰͘Ȟ̷̡̹̤̫̹̞̜̱̜̣͕͖̇̋͂ͩͯ͑ͨ̒ͭ̏͐́̒ͯͪ͡U̫̙̹̥̪͊ͬ̈ͦ̌͌͑̂ͯ͒ͦ͐͢͡Ȅ̉̉̿̕͘҉̰̫̪͚̠̰̭̳̝̖͓̩̥̘W̵̢̛ͫ͂̎̇̒̅̈́͐҉̤̭̺̦̼F̶̨̛̼̹͎̩̌ͫ͂͋͋͐̎̒͝Q̤̼͍͖͔͎͈͎̯̖̪ͦ̇͂ͤͯ̏͗͋͆ͦ͟͡͡I̿͌ͣͩ̉̽̓̓̚͏̜͚͔̤͍̩̣̦͇̪͚͇̲̜́Ŭ̸͎̠̖͚͍̰̫̭̼͓ͨ̂͐́̿͆̈ͨͪ̇ͧ͑ͣ͂̂̄̿̀Ơ̝͎̭̟͔ͪͨ̏͌́ͧ̋̌̓̋͑ͥ̌̑̌ͬH̡̨ͯ̏̊͌̓̽ͫ̎̽̐͜҉̵͍̼̖͔̰͎͚͇O̸̡̫͕̥͉̯̣͚ͤ̈́ͦͧ͛̍̃F̍̇ͣ̂̉̑ͤͥ́̀͡͏̻͔̺̩̜̖̬E̒̃̐͂ͫ̓̉̀͗ͣͥͨͦͫ̆̿͑ͨ͏̬̫̲̩͇͉̩̭̭͇͝Ẅ̧ͧ̎͆̈ͩͪ̎ͣͣ͆ͫ͟͏̢̖͙͓̩̭̪̜̬̫͓̥͞I̻̺͙͎̎͐ͯ̋ͦ͗̃̌ͭ͊̓͑ͣ̋̎̆̚͢͢͡H̵̨͕̖̦͕̒͋̐͌̄̅ͨ͛͒͒̔͒͗̚U͒ͤ͗ͣ͆̀҉̶̜̰̫̗̝̘͔̘D̩̺̼͔ͮ͛ͨͭ͆́̚͞͠S̴̡̙̟͎̥̝̔̈͌̀͘͜V̊͑ͯ͛͐҉̡̨̛͎̩̙̦̟̣̬̖͔̤̺͓͍̼̦̟̩͎͙J̶̧ͩͧͩͯ͛̉̉̂̓̀͗̎ͯͥ͌́͗̐̚͏̶̡͍͙͍̘K̴͒͊̄ͬͩ͂ͤ̎̄́͏҉̶̫̘̯͍̻͙̲̜Ḩ̴̢͎̗͈̼̤̯̭̝̻̭̬̘̭̗̼̥̅ͮ̄ͨ̾ͣͨͪͥ͑̚͡ͅN̛̬̻͍̖̥͚̻͚̞̙͙͓̗̋̆ͧͣ͊ͧ̋̓̾ͥ́͂̈́͐̏̾ͣͤ̀͘͝͞G̪̺̖͔̭̲̹̐̿ͪ̑̎̕͝R̵̛̖̳̩̗̰̰̳̼ͥ̽̓ͤͩ͜͢ͅͅE̴̴̜̝̭̦̩̦̪͔̻͕̼͋͊͗ͭ̄͌̚̚͘J̵̉̽ͦͮ̓ͪ͌ͪ̋́̚̚͡҉̡̫̳͚̥̫̻̣̘̜̙̻̺̙͎̲̘͠H̴̨͉̗̤͔͓̟̬͆͛ͮͬ̅ͧ̎͘ͅB͕͙̠̣̯͇̠͎̲̱̯̙̼̮̳̲̖͍͂̑͋̊̀̌ͤ̆͂̇ͤ͛ͥ͛ͣ͂̏͢͡K̸̩̹͕̃̿̒ͨ̆͗̒̏ͮͪ͊̋ͯ̀ͫ͆̿̽ͥ̀͞G̨ͣ̄̌̃̈́̂̾̄̍ͧ͐̈́͌̆́͢͠͏̟̣͍̣͚̳̭̻͔͈͕R̹͙̝̖̻̤̭͓͓͔̝̳͖̎̎̃̎͆̕͝͠Ȩ̴̴̛̲͎̥̦͎̗͚͇͈̞̼͔̿̋̅ͫ̃͂̂̌̒̏̈́̎͆ͨ̈ͣ̌̚Ư̛̲̱͈͓ͮ̎̐͒͂̀͟Ḩͪ̄̐̔̔̑̽̈́ͯ́ͨͣ̌̚̕͏̷͎̲͔̦̯Y͊̎̓͐̒̑ͥ͊͑̃̒̀̾ͩ̒ͬ̏̔҉̵̸̨͏͎͕͕͖͈̹̭̤̹̗̝̲ͅͅG̴̠̲̰͇̰̙̱͇͇̟͍͙̮̪ͧ̏ͯ̋̿͌ͪ͢͠F̵̸̘̳͓̘̙̮̖̲ͨ̏̅̉̌ͬͤ̑ͦ̂̉̔̍͂͛̚̚͟͟͞R̡̛͓̳̟̳̰̪̟̋̆͐̽̀̕ͅȨ͕̬͖̯̭̞͎͚̟̞̫̗̝̯͔͈͉͌̄̈ͨ̆ͭ͑̿ͮ͝ͅU̷̷̘̬̲̪̺̤̫̺̫̭͚͖͇ͥ̾͗̓̂̌̉͛ͧ̒̈̊́̏͟͢ͅͅͅH̶͕̪̮̠̹͖̩̗̘̪̤͕͖̗̱͇̥̣̐̀̔̂́̌ͬ̂̆͂̕͝͠Yͬͯ̈́͜͠͏̧̤̤̠͇̫͇̩̬̹͔̼͢Ï̸͊͆͑͒͛͗̑ͥ̈́ͧ͢͜͏̮̮͎͕̩̳̹̞̫̗̲͉̳Ḑ̩͚̹͙͚̪̣̟̐̃̌ͭ̋͂͋ͯ̓̓̓́͟͞S̴̜͔͔̝̼̠̟̠̖̍̄ͩ͆ͯ̔͛́̕͢͞J̸̛̦͖̹̼͇̯̣̤͔̹͓̘̳̙̤̲̹̆̈͂̈̓̉̃̃͐ͭ̅ͭ̀͡͝ͅͅO̮͓̝̼͚̥ͮ̂ͦ̐ͦͥͧ͆͐ͬ̑͌͊͛́̚͢͞D̅̌ͮͧ̇̇͐͗҉̢̦̹̟̝̰̟̝̤̘̦̪́̕W͑̿ͦ͒̌̍̅͛ͪ̽̓̿̒̈́͊͆ͥ̚͏̷̶̨̦̟̭͙͙͉͕͔͝Ê̩̠͖͇͈̍͑͒̓͋̏͑͊ͪ̄ͣ͊̅͌̓̆̏͋́͘͟͝Ư̵͎̤̲̥͍̹̣̳̤͎̯̝̬̠̥̺͉͔ͤͬ̆̉̇̑̈́ͭ̅̆͑͗̓̈ͨͩͧͦͅH̟̦͕̙̱̻̰͇͖͑̑ͪ̉͑̾ͦ̀̏̀̚͘͟Ḋ̮̪͉̮͙̘͈̙̮̻͇̹̓̇̊̌͆̓͌ͩ̌͋ͭ̄̃̉̍́̚͞E̷̡̘̮̺̦̲͈̥͔̰͂̌͋ͧͪ͗ͣ͑̃ͩͩ̈̐ͫ͗ͦ͘͜Ų̡̙̺͔̫̲̻̦̰͈͗̌̊̔̑̏Y͈͔̥͎̙̹̖͇͓̥̲͉̻͙̤̌̂̾ͭ̿͊̄̕͟H̷̸̟͓̬̋̃̆̀̓͛͌ͥͪ̔ͬͤ̔̚̕͡ͅĮ̼͙̟̣̙̞ͨ͋͊̃̽ͫ̍̆͆ͮ̿͑ͮ͂̾̎͗ͬ̕͞F̡̢̜̟̙͉̖̝͈͈̼̠̹̹͍̜̝̈́ͪͣ͛̈́̒̀̕͡N̵̯̮̮̫͚̗̻̘͇͉̲̩͍̼̔͆̓̉̽̆̚͟͝J̶̞͉̬̭͚̦ͯ̅̎̃ͦ̏̾ͧ͆̾̅̏͌́͠G̴̜͓͉͇̟͒̊ͩ͗̉̑͛̀R̵̨̢͓̜̟̰̬̖̩̀̆̈́̇̑ͫ̆͘E̅͛͆̋̆̍͗́̒̂̿ͧ̋̿͒ͬ̍ͮ҉̷̧̘͔̯̭̯̞̠̣̞̭͟H͚̱̰̥͍̙̫͔͙̘͈͙͈̠̓̽ͮ̎ͯ͟ͅŲ̳̹͚̣̼̥͔̫͈̂̾̃̌̑́͒ͨ̾̊ͥ̀͒̔ͦͦ͐͒́̀͘͘Ę͒̏̀ͦͣͬͤͮ̒͋̌ͪ̂ͮͦ͊ͬ͌̑͢͏͓̩͕̜͉̬̘̮͉W̬̻̱̥̗̝̻͓͕ͩ͑̏̐̊̊̓̔̋̅ͦ̓͐ͫ͋̓ͭ̋̓͞͡ͅÝ̡̛̗̫͎͈̬̲̯̟͑̈́ͮ̐̍͂͑ͫ̄͆ͧ͊̔ͫ͆͘͟͜Ğ̘̮̩̣̺̙̭̱̖̺̮̪̣̘̭́̾ͩ̉̽ͮ̊͟͡Ḛ̸̛̭̩͚̩͕̥̗̯͈̜͙̾̉ͥ̉͒ͨͦͦ̀̀̚͜Wͩ̍̓ͧͣ̏͗ͤ̽̏̈́ͧ̒ͯ̒ͤ̍͏҉̫̱̝̦͕͉̫̰͍̫̙͉̤̬͚ͅF̨͔̝̟̯̖̳̫̘͕͓̱ͬͤͬ͐̍̍̀̐̀ͤ̌̕̕H̨̤͓̟̤̗̹̼͎̩͈͉̞̺̏ͫ͂̆ͯ̍ͦ͢͠Y̴͈̱̦̖̜͎̙͍̱͍̭͓̩͎̆̓̊͗͑͋ͨ́͌̅̾̄̎́̚͘͘H̵̨̹̰̙̝̻̰͉͓̥͈̞̲͇̳̤̺̗͍ͨ̇̊̔̂ͣ̂̆͆͆̍̕U͇̟̻̰̬͆ͮ̔̓̏͌̐͛ͧ͞͡͡F̧ͨ̒̊̏̊̊̿̒́̊ͪ̈́̕͜҉͈͈͉̠͈̼̗̟͍͖̫͜ͅḚ̻̻͍̣͇̭̲̯ͭͦ̇͌̓́̀͢͝Ḣ̆̽ͨ̌ͯͣͣ̊̀̿̆́͡҉̥͚̰͎̀ͅĢ̴̡̲̤͚̝̘̞̫͖̞̠̤̐ͥͩͮͩ̿̽̏̋ͤ͌̅ͫ̍͒͒ͣ́̀F̶̞̯̖͇͖̪͈̩̩̜͙̣ͫ͌̍̈́̕͘Ē͚̞̺̩͎͕͍͇͔̥͔͂ͯ͌̔ͦ́̕F̨̀̓̆̍̿͐͂̄͡҉̶͚͙̩̣̝̣̯̦Ě̵͊̑ͯ́ͯ̉ͣ͒̈́͋҉̗͙̩̣̳̩̭̹͠U̧̮̖̼ͦ̿̆̈́͑ͨ͑̾͆ͮ̑ͮ͟Y͚̠̜̭̹͓̼̣̲̠͔̠̙̺͕̟̼̍̽̽ͭ̂̉̀͢͞F͈̦̭͇̮̥̬̙͕͇͖͖̮̄ͤͤ͊̑̀ͨ́͢͜͡U̶̻̜͇͔̜̼̝̫̥̿̈́̑́͆̐̕͜͝Y̶̛͉̪͙̤̟̠̠̼͔͍̥̹͕ͥ̍ͮ̓͛ͮ̏͑ͬ̄̊ͭͩ̒̇͌̚̕͡Ĥͥ̓̏̓͒̒ͤ̋͏̸̛͚̩͙̲̯̲͚͇͓͢ͅF̴̧̛̳̺̫̤̰̬̱̯͉̞̞͖͚͕̙̹͖̋ͬͤͥ̇Ę̷̴͔͓̰͕̮̰̲̝̥̣͉̲͍ͧ͂ͥ̍̌̋̐͐ͥͮ͗͋̂̊͜͞U̸̵̷̼͕̩͕̣̦̙͗̾ͫ͆̿̿ͤ̉ͨͦ̒̃̋̎ͤ͞͠H̨̡̛͙͖̯̮̫̗͉̞̪͙͉̝̰̪̦ͮͤ͋̾͛̈̀ͭͦ͋̓ͮ̑ͣ̉̕͠ͅÏ̂͌ͥ͏̛̪̰̼͍̜̰̳̟Ū͐̏̈́͋͆͂̏ͩ͐̇ͧ͆ͪ̒̎̋͆͢҉̞͎̻̺̳̗̺̤͚̬̟̞̪̻̣̼̕H̫̤̼͙̞̘̝̠̟̞̫ͮ̈͗͂́̒̑̈͐ͨ̿ͧ͒͆̎̕I̴͗ͮ̄ͩ̿̚͏̰̙͕̣̩̰͚̦̕ͅŲ̯͙͓͔̩͔̖̠͕̐̔̍̑̊͌̚͘͞G̨̛̫͚̩͕̮̮̲͌ͫ̂͂̽͑̓̿̐̓ͯ͗͊ͨ̕͠ͅŞ̷͖͚͔̪̪̞ͧͬ͒̋̉͋͌͋̈̔͟͟͞ͅO̥̥͓̫͈̳͒̇ͫͪͭ̍ͮ̿̋͗̉ͧ͜ͅIͨͦ͒̿̈́̇҉̙̖͍̹͓͓͓͉̯̪͜ͅR̸̛̪͇͈͚̺̦̣̮͗ͦ̅̉͒ͥ̾͊̅̈ͧͫ̈́͆́͢Ö́́̇̇ͧ̔ͤ͒ͥ̔̍͛ͣ̊ͤͬ̏́҉̶̜͓̻̬͟͞I̶̸̥̯̲̥̻̤̙͇͍͖̪̭̰͚̹̪̼͙̒͌ͮ͆͒̂͒̑͒̐̈́́̌̈ͬ̐ͫͮ̀͜J̨͓̮͇͓͚̬̩͇̩̳͒͛̎͜F̥̙̹̻̝̱̓̎̃̏̔̊̓̿ͬͪ̃ͯ̎͛̔̀͝ͅÊ̶̡͚̜̥̪̝̆́͆́ͪͦ̄̍̊́͊I̢̳̰͇̼̫̻̥͎͍͙̅̂̃͌̄͋̐̃̀ͧ̓̚͢F̢̦̰̙̳͈͓̤̘͖̯̘̭͂̅̀ͩͧ̊̿̔͋̋̆̎͌ͦ͛ͦ̾͑ͪ͘I̶͌ͯ̑̄̄̃ͫͥ͑ͫ̑ͤ͢͏͈͖͖͈̼͠Jͭ̄̊ͩ̿̎ͮ͗ͮ͏̨͍̜̯̖̲̻̮̰ͅĄ̨̨̺̞̺̙̮̌ͭͣ̋ͤͭ͆̂̆͐̋̓͝F̯̰͉̗̮̝ͤ̂̔̾̓͌͐ͯͭ̾͜͝Į̴̴̡͕̥̼̞̪̺̪̘̻̝̥͎̱̣͖̦͇ͨ͗͛͊̌̃ͥͮ̐̍̆̇̔̆ͤ̚͘U̴̢̮̹̠̥̱̝̱̦͉͇͎̦̟̦͇̘̹̪̹ͤͣ͂͛͒ͬͮ̑͒ͩ̇̐͢Fͨ̾̽̂́͋̎̐ͧ͛̑̚͢҉̢̟̹̮̯͖͢͡A̢̩̠̜̯ͣ̏̂ͨͯ̐̉̓͌ͣI̧̥̠̲̙̠̙̞͈͇ͧ͆ͭ̄ͯ̂ͤͧͩ͒̔̍͌́̚̚Ų̢̮̞̮̠̲̓ͮ͌̽͘ͅJ̖̱͍̼̞͌̐̾̿̅ͬͬ̄ͤͣ͑ͩ͗͐̉͂ͩ́́͢͢ͅH̢̦͚̮̹̞͎͍̩͈̼͖̥͎̓̉͛ͫ̚͘̕͡F̵̧̨̀̌ͤͬ̾͗̽̋̄̐͐̊̓͂̌ͩͦͤ́͏̠̝͕̗̦ͅĘ̡͙̠̰̺͎̩̟̪̺͍͋̀̊̌̽̌͗̂ͭ͗̅͊͟͡͠W̺̪̱͍̦̞̩̔ͫ͐ͭ̓̌̂͝Ā̵̖͍̠͙͉̣̮̮̺̜͓͈̟̱̪͍̉ͩͮ͊ͪ̄͗̊̀̉ͯͬ͗̓̔ͧ͛̆͘͜͝Ḯ̹̠̞̣̻̖̬̱̟̫͕͙͍̯̲̅̎ͮ͘U̵̡̺̤͈̹̮̺͖ͧ̊ͫͧ̃̍ͮ̊̽̒͗̇J̓̋͛ͧͬͭͪ̽̾͏̨̣̞͚̥̪̪͈̝̭͉̯͖̜̮͈F̴̟̰͙̹͎̫̣̟͇̘̠̖̞̻̗͉̤͓̮̽ͤͮͤͫͭ̐͗̀Í͒̐͑̓͂̾̑ͨͣ̋͊ͨ͑ͦͨ̍̀҉̘̞͇͙̕͞J̧̦͈̫̗͙̹̼̺͎͑ͥͧ̉ͮ̀͘ͅỤ͉̣̊̑͋͑͆̾͌͐̃͆ͪ̿͗ͭ̽͂͟͜Â̴̇͒ͨ̇̆̔̀̂̿͡҉͍̮̪̳̳̼̞͈͈̕F̶̥͖̫͚̤͙̭̖̺̘͈͉̳̠̱̩̤̑ͣ̀̌͟J̍ͫ̊ͣ͂ͮͩ͂ͦͯ҉̣̦͕̙͍̪͉̝̦͈̙̭͟A̸̷͒̍̾̒̅̈ͯ̽̔̎̽̓͋́͂͏͖͚͔͈̯̦̗̘̭̱̹͎͖͙͍̜̦̺ͅḨ͍̤̱̻̲̪̹͈̥͕̼̐͊̽͒̊ͭ͛̑͂͐ͬͦ͌̉ͣ̀̚͝A̋̾͐ͯ̎ͤ͟͞҉̠͇̱͔̻H̡̨̡̛͙̱̤̹̼̗̯̬̩̦̱̳̭̘̀ͥͣ̆͊́̈̈́̍̅̈́̍̌ͬ͆ͯ̚̕Ą̖̱͈͈͙͉͙͔̯͖̜̩̮̇̋ͫ̏̎͋́̂̇̔̍̋̄ͧͦ̌̈̊̀̚͜͠W̵̰͔̺͎̰̺̰̹̗̳̲̜̩̙͖̾̓ͫ́̅ͣͫ́͝E̸̢̼̺͎͔̘̻̺̹͂̑̆̾̓͂ͯ̎̒ͮͧͦ͌͊̿̋͆̽̋͠J̴̟̫̭͓͈͎̭̙̍̽ͫͬ͊̈ͨ̈́͐̈́ͩ͗̌ͥ̽̾̾͡I̢̠̤̱̠̻̲͕̖̬̪͕͚̫̳̺͔ͭͮͭ̋ͫ͋̽͑ͥͩ́ͅH͂́ͧ̐͑ͤ͐͑̀͒ͥ͡҉̭͙̼̳̤̱͍̠̲̻̭͙͉̼͢͞I̵̭̹͕͙̠͕̱̳̬͚͍͖̫̖̫̲̮̘̋̃ͣ̿͂̂ͩͪ̓F̿̾̔̆͛ͯ̄҉̡͇͎̜̪̲̹̭̥̪̖̻̹͘͘͠Ḛ̡̨̱̼̱̬̲̳ͤ̓̅̎̇ͯ̃͒̈̂̃͛̈́͑̒ͤ̅̔̚͞J̴̵̹̠͕͎͕̘͈͕̫̝̰̳͓̯̭͉̣̊͆ͯ̕N̸̅̐̽̈́ͣ̐͊͑̅̔́̓̊͟҉̖͇̬͚͔͔͠H̥̠̮̭̣̺̥̳̮͔̤̮͖̠̺̬̼̖ͥ̋̓̏̊͛̋͛ͧͩ̄̀S̷̴͇̫̝̗̹͈͖͇̝̳͙͈̣̬͖̗̮͆͌̿̿̓̂̂͌͌͝H̶̭͖͉̭̫͖̻͋̐̅͋͜F̛̣̩͓̰͚̦̫̳̪̬̪͍̱̮͇ͤ̆ͫͥͩ̄ͩ͢͢ͅFͦ̈ͯͤͯ̒̓͢͝͝͏͕̩͙̞͎̪͓͖̺̤ͅH̷̢̳̼̩̪͓̍̈̍̓͆͡U̶̢̙̹͉̪̘̥̘̰̻̟̝̖̗̦̓̉̉̾̃͛̎ͤ͐͐ͨ͂ͬI̧̧̛͎͕̙̭̱̥̞̳̞̻̫̳͖̬͎̥̮̔ͣ̋͌ͯ̄ͥ̽̂ͅH̏͗ͨ̚͏̷̠̣̩̘̫̀Aͭͩ͌̽͑̑̾̓͆ͥ̇ͫͭ͏̵̬̰͍̙̫͈̩̞̻͔̟̪̺̺͞͝H̡̝͈̝̦̻̟͕̫͈̠̪͖͚̯͎͌ͯ̌ͪ̿͂̈́̐͒̂̓̃ͦ̋̔ͬA̵̤̝̼̺̬̻͉̖̝̖̭̥͖̲̼̽̍̎͛̉ͦ̀̐̊̀͛̇̊̆̕Ḩ̷̛̗̮͇̟̹̺͇̖̗͚͎̄̽͊ͯͦ̀̇̃̾͟ͅA̵̵͕͉̝̪̹̹͍͚̞̼̥̜̘̭̹̙ͮ̐͑̋̌ͯͬ̚ͅḨͣͥ̀̏̒̇ͬ̅̈́̈ͪͮ͋̅̍ͬͧ̈́͏̖̪̭̦̻̥̼̞A̟̖͕̙̙͔̻̦̹̱͍̥̳̦͖̫̒̍͋ͨ̌͛̉̽͗̽͋̅ͤ͑ͮ̎́̀͜͡ͅͅH̨͐̄̾ͭ̋̄̐͑ͦͩ҉̶̻̻̭̺͓̖͈͇̤̱͍͈͓̫͘A̴͇̖̞͓͂̾̒ͥ̍̆̈̕͡H̊́̅ͫ́͜͏̷͏̯̰̝̰̹͚̰̩̣̙͢A͌̔̽͐́́͏̱̖̙͔̹̦̲̪͉̬̼͎̯͓̀̕ͅW̓̃̀̆̈́ͯͩ͆͊ͯͧ̍͒̈́̾̂̔͏̺̜̘͖̥͇͟͝E̴̼̺̠̜͔̣͓̜̝̘̤̯̦̙̩̯̗̾ͭ̋͗̏̍͐̓͗ͤͦ̏͐̃͢͢I̢̱̘̲̞̮̫͔͎ͬͩ̃̐U̶ͬ̍̑̾̄̊ͦ̄͐ͬ̒͂͂̚͡͏̮͙̩͔͚̻F̸̷̷͔̳͙̹̥̖̥͔̤͙̜̬̪ͯ̑͑͋͌ͦ̃̓̆̇̅̉̔̀̍ͪ̚͡͞H̷̵̨̛͈̺͔̺͕͔͚͛̿͐̅̉̆͌̓ͨ̔̔͟Ấ̔͑̿̚͏̡̨̬̻̤̥̘͎͈̫̻̻͇͎͕̯̠ͅF́͑̏̆ͫ͂͏̸̶̺͉̜͇̗̬͙̹̹͈͇̘̮̪̗͍͓̀ͅI̛̛͗ͪ̅̿͟͏͏̭̲͖̫͉U̳̗̖̮̘͍̞͉̣̤̥͚͈̗̩̬̯̜͖ͮͧ̆͂̃͝F̵̖͕̤̪͔͎̟͙͉͉ͤ̆͒̊͛͌ͤͦ̀ͅÊ̯̫̯̬̪͖̭̰̫̞͖̒̿̒̈́̒͋̂͌́͜ͅͅW̵̛ͮͨ̿̊̽̈́҉̫̺̬̩͙̳̻̺̞̗͈̣̳͙̹A̶̴͈͚͈̫͔̰̦̳͓͛̀͒ͦ̃ͨ̊̋̆̑̇͗ͬ̍̂̋̂̽Ì̴̢͚̤̦̬̯̖͍̲̻͍̝̫̰̻̖͙̈́̏̄̾̈́ͪ̿̄̋ͪͥ́̆ͦͧ͌̚͘Ơͤͣ͋̇ͦ͆̃̆̓̎̉ͦ͠͏̵̝̥̹̳͖̰H͈̞̮̰̲̠̖̯̼ͥͧ̎ͭ͆͐̉̓̇̈ͮ͢͞͡A̢̱̪̰͓͇̻͉̲̺͓̲̟͖̼̐͊̽͑̈́̍ͫͨ́̍ͣͭ̚̚̕K̶̢̦̤̘̭͈̙̱̲͖̤̖̱͆̇̓̌͂̎͌̔͂̾̇ͣͪ́ͥ͟J̵̧̼͚͉̬̖̹̜̫͈̩͖̭͇̗̤̇ͩͮ̐͂͛̐͊̉ͭ̈̚A̛͇͚̪̬̼̼̯͙̻͋̓̓̓̓ͥ̍͒͆̓̎̆ͭ̕͜͟͡ͅH̸̤̘̙̹̟̟͙̮̘͍͕̩̣̟̱͙̭͍̯ͤͥ̾̓ͥ̎̀͜A̽ͨ̆͗̉ͮ̍́ͩͪ̊҉̸͙̝͍̜̭̼̦̱̀Ḩ̴̴̸̶͎̱͚͕̜̉̈́ͥ̆̽͑̊̎̓̂ͦ̓̎̈́̇̚Hͧ̓́ͫ̆̈͊̏ͥ̈ͮ͊ͩ̂̐̚̕͏̟̜̪̬̦̮̣̣̹̰̬͢A̷̛̮̠͔͔̞͙͔̦̝͖̱̫̬̟̪̯̹ͨͤ͊̌̆̓͋̃͛̿̄͝ͅÀ̸̡̝͖̬̹͖̭̲̜͍̘̱̠͇̜̥̻͓ͮͤ̔͌̀͝ͅͅḨ̴̨͙̮̩̤͇̥̜̦͇̈ͥ̊͊̎͌̔̽ͯ̓͒̎̎̾́͢H̴̵̷̼͈̤͇͍͖͙̩̰̙̱̹̝̫̑̓̈́ͨ̄ͣ̄̊ͪ͑͑̎ͯ͛̒ͣ̽ͅA͈̹̦͎̘͚̰̟̤̥̙͒̂ͤ̈̅̃ͤ̒͠ͅH̢̡̳͉̥̰̙̰͙͌̔̅ͨ̒̏̾ͧ̎͐̍ͨ̒͗́͝͝Ą̟͎̘̭̣͉̰͖̙̬͎͎̂̌ͮ̎̏ͧ̅̀̓ͭͫͤ̓̀̚͜͜͝H̸̶͎̙̭̯̏̅̒͐̃̏̈́̒̇́ͦ͋̾̏ͭ̓̓̕A̶̧̮̰̫̰͙͈̼̗̗̥͓̖̖͚̬̜͚̅̐ͦH̷̵̛̘̪̰͍̯̮̯̪͎̀ͪ̍̆̇̑ͧ̓̃̚͟Ả͗̀̒ͦ̂͛̾̅ͣͨ͌͏̧͈͖̰Ḩ̲̹͓̯͓̹̭͉̬̭͙̑̽͐͐̑̓ͭ͘̕͜͝A̢̪̗͕̞͔̺̤̜̥͚͑̐̑̽ͣ̌̄ͥͦͥ̑͛͋̎ͥ̑ͭ͢͜͝H̵̵͚̟͍̬̗̪̣̗̪̫̮͈̖͕̻̟̲̎̋ͧ̍͌ͨͭͥ͑͐̋̂̉ͩ̌̓̇A͓͓̟͓̠̗̮̱̱̫̱͈ͩ̓̒͛͜͝Ĥ̏̆̍́ͭͤ͋ͦͫͬ̇ͤ͝͏̸̷̲͚̦̥́Å̶͓̩͇̠͎͎͖ͪ̓͐ͩ̈̀ͅH̓ͭ̔͆ͭ̒ͬͫ͛ͮͥ҉͕̺̥̗Ǎ̶̶̡͇̺̮ͧ̊͐̌ͯ̑̚H̵̺̼̝̖͓͇̮͉̲̲̆ͨ̂̀̎͋́ͅA̸̸̷̟̲̘͇̱̮̗͓ͭͨͪ̊͛͑ͨ̓ͣ̀ͮ̊̿̊̋̀͋ͤ͑͢Ḥ̷̻̯̠̮̹̞̺̗̟͖ͭ̏ͩ̓̓ͨͥ̓ͥ͂͒̈͝͠ͅH̛̍̎̆̌̈̌̐ͪ͌҉͕̺̞̱̠̫͚̰̦̤̤̺͔H̡̰̜͔̣̭̞͎̗͓̟̺̬̔͌ͩ̽̍́͝A͊ͣ͊͋ͭ͏̠̤̮̥̘͇̬̝͜ͅH̨ͣ̄̿͆̇̂̅ͫ̅̐̓̉͏̧̘͇̯̜͓̦̙͙͓̫̲̘͕͍ͅͅÂ̸̶͒̄̾̽̓͐̀̕͏̱̹͙͓̜̼̯̩͎͕̦̗̘̗̦̟́ͅH̸̶̢̛̬̟̖̳̱̲͔̯̘̤̲̮̓̏̀͋ͫ̂̇͊͑̄͠ͅA̷̤̙̝͚̦͓͖̝̟͇̭̮̐͗͒ͮ͂̾̃̊̿ͩ̆̄̅ͥ́ͤͣͣ̍̀͢͞Ḥ̴̬͕̥̥̆ͬ̈̉͆̏̆̐͊̒ͦ̚̕͠͠A̴̶̧͚͙͇̝̭͕̳̖̪̟̣̝̻͓̤͖̠̬̰ͫ̾ͮ̈́͒ͫ̐͐̀̿̈͑͡H̨̡̨̳̪̰̥̣̟͇̦̰̗̣͖̬͚͙̺̃͑ͣ̏ͩͧͦͣ̇ͯ̆̔Ǎ̎̽ͪ͟҉̶̝̥̦͎̜̱͙̰͙̹̞̼̼͉̪̦͢Ĥ̴̴̵ͭͦͨ̏ͨ͏̢͔̯̹̯͕͔͈̬Ą̷̜̻͓̗̩͋̓ͤͨ̔ͬͭ͂̇ͪ̐ͩͣ͋͛ͯH͈͍̪̭̱̗͎͚̼͈̮̱͇̙̓̅̒̊̈́̿ͤ̃ͧ̒̇͑̇̋̅ͯͩ̀͜͢͢A̵̶̝̘̘̥̣̲͓̺̪̦̞̪̬̠̰̩̠͑̅ͩ̋̽̀ͮ͛ͪ̈̌̓̿ͤͭ̒ͫ͆͜H̨̛͂̑̈ͪͣͭ͂̾͆̈ͯ̅̌̏͌͆̌́͜҉̡͇̹̮̻̥͕͓͎̗͎̼͍̞͈̙͈͙ͅͅA͂ͫ̽ͭ҉͇̬̟͉͎̖͈͈̱͎̥̮͖̝̩̹͖́͟͟H̝̮̦̜̳͈̦͉̬̳ͥ̈́̐̿̇̍̎ͭ̒̅ͪ̊͒̚̚͡͡ͅA̗͎̤̗͕͇̩̪̥͑̓̈́ͫ̍͗ͩ̈̿ͬ̽̿̊̽̈̄ͮͪ̀͡͡ͅH̶͈̭̘͔͈͚̗̣̭̋ͦͫ͛̔̈́̐͊̋̏̃̓̔̀̚͝Ä̷̸̷͔̤̩͍̳̬̟̭̪̼̰̱͖͇̝̌̃̏ͪ̍̒͐ͣͣ̑͐͋̚͠H̨̤͕̦̲͚ͣͤ̒͒́ͣ̕A̵͓̫̭̰͍̼̭̫̳̤̮̮ͧͦ́ͫ̑͋̈ͭ̓ͦ̋ͬ͛ͥ̊͢ͅḢ̸̩͍̲͔̹̯̱̳̪̬̓̉̿͗̏̚͘͟A̵̫̙̜̬͚͂̇͐ͮ̌̈̉͐̇̕͡H̵̨͚̪͕̭̲̟̻̜̹̹̜̱̯͗̎ͩ͌̎̏ͪ̇͘ͅĄ̶̓ͩ̑̉̒ͪͥͤ͏̴҉̭̞̺̘̗̠͕̱̗̳H̨̠̙͇̮̺̣̜ͭͥ̅͂ͮ̋ͫ̆ͨ͛͗̈̓̋ͬ͢͠A̛̹̱̬̪͕͕͉̙̻̖͉̤̻͙̘̠̔ͦ͆͐̑̌͗͌̽̃̄̾͘͞Ĥ̴̸̨̻̻̫̦̘̅̃̃̓̄́͘A̡͙͕͖͔̩̰̜ͪͩͤ̄́͝Ḫ̡̹͎͔͎͔͎͇̝ͤͪ̆̊̔̅͌̿̊́͠ͅH͊̓́̽ͯ͐̊͌ͨͭ҉̴̤̱̙͕͚͓̮͍̥̰͉̼̩H̨̧̟̦͉̹͈̲ͪͭ̋̿͂̋̃͐ͧ̏͂͆̅̍̇̈̅̀͟͜Ȧ͐ͮ̑̚͏̨̥͉̥͇̱̲͈̲͜H̬͖̻̯̰̭̩͚̬͓̻̳̎ͪͨ̽̌̐̌̀͜͞ͅA̐̈̓̔͌͛͛̅̑̓̂̂̂ͤ̈́̔̌̅͢҉̶͔̥̩̖̭̻̙͙͈̪̙̹̜̪̙ͅH̵̵̡̪͔̲͍͙̙̹̙̦̱͎̺̬̤̝̙͗ͧͪͮ̽̆̿̄́ͥ͒ͤ̈́́ͦ͊͒̀ͅA̽͛̊̾͒ͨͫ̂̿͒ͦ̒̊̀ͮͧ҉̬̞̳͕̘̟͇̥̳͖͇̰̬̹͙̀H͂ͩ̀̄̃͑̈́ͣ̌ͦͭ͛҉̴̜̟̠͇̼͖͖͇̖͕̥͓̤͖̣͚A̡̤̥̩̜͕̦̮͍̦̣̦͕̙̪̦͉ͯ̊̌͂̊͒̉͢Ḧ͎̼̳̞̤̖̰̥̙̘̩̆ͭ̄̈ͪ̔ͫ̔͘͞Ȧ̴̵ͦ͛̔̋́҉̮̭̦͕̠̱̜̠͕͓̞̗̗͕͍̪̩ͅŲ̠͚͓̳̲̺̱̳̪̩͎̤̹̮̻̼̈́͐ͯ̄͐ͮ͆͜Į̶̵̯͓̥̣͉͚̯̞̞͈̞͚̲̦̰̹̹͈̳ͧ̎̾ͩ̄̀Aͧͬ̎͛̑́̚҉͚͙̞̻̞͎̦͍͇̗̗̯̮͚͠͞F̵̶̨̮̲̭̯͍̦̲̯̣̱̩͉̠̱͓̜̉̓̇̿͘ͅH̶̵̡̟̟͕̲̲̠̭̬̲̫̻̀̎̅ͫ̿͐ͤ̿̃̕͞I̸̛̝̩̣̩̩͎͈̤̣̭̲͖͔̜ͣ̌͗̓ͮͦͣ͘U̢ͩ͗ͯ̏͊ͯͤͧ̈̋͋́ͮ͏̨̰͚̜̪̯̣̭͠A̷̢̟͓̻̭̗̝̮͙̗͉̜̘̗͙̭̦͔͇̣̍̏ͪͪ͌͒̉̑̾ͪͧ̽͑̽͋̓̊͘͞F̵̵̨͈̭͕̱̤̹̱͓̤̉͂̈́́ͫͨ̌̈́̏ͣ͑ͪ͘͢Ë̸̤̹̮͉̭͍̝̤̮̬̞̩̗ͣ̒̇ͤͨ̋ͣ͐̆ͥ̚͠͡H̴̡̳͕͔͕ͧ̿͑ͧ̏͊̂ͪ́̔̈́̒͑́͟͞Ừ̶̢̗̬̼͓̦͎̟͉͉͔̬̞̺͎͔̣͖͌̂ͮͧ̅̔̆͂̀̉͝A̓̋͊̽̋͛̚͠҉̜̳̗̻͘͡H̶̡̪̻̞͔̞̜̻͍͔͊ͩ̀͑̅̽̌̍͛͐͝ͅĂ͕̰͇̮͚̩͇̬̬͇̔̄͂͋͒́ͬ̓ͨ͘͠ͅH͖͇̬͓̖̘̝͔͓̔̓̊ͣ̾̍ͩ͌̐ͩ͊ͥͧͤ̄̑̓̚͢Į̞̩̪̪̻̞̦̺̤̤͍̪͇ͣ͛ͫ̋̎ͯ̋ͭͩ̔̐ͤ͌͑̉̓̍̄̀̕͡Ư̷͈̜͓͙͙̰̗͇̮͇̑̇͆̔ͩͦ̍͐͋͆̈͑͌̀̆̿͑ͭ͘͠ͅͅS̨͋͒͛̽ͪͪͮ̒ͭ͐̒̆͋̊ͤ̐͟͢҉̪̤͓̦̺͈͈̭̪͕̫̻͍̗͜F͇̪͎̥̲̣̲͚̲͚͔̝̗̥̞̥̬͉͂ͧͤ̎̅́͘͡͠ͅȨ̺̣̹̘̜͉̬͙̞͍͖̱͚̊̅̐̒͑͆́̚͝Aͧ͛̋̓̋̆̃̅̄ͦͯ̆ͬͯ̌̈́͜͠҉̵҉̩͉̗̣̖͔̟͉̰͙̘̲̟̞̯̻̬Į̨̳͚̘̬͇̫̫̭͇̗̭̺͚͐̽ͯ̈́ͯ̋ͥ́̊̚Ṵ̱̝̰̯̝̮̖̣̞͙̣͈̩̞̱̲̾̈̽́̆̋̈̈́̃ͯ͆͆́̑ͪ͗ͧͪ̀ͅH̿̓̽̀ͩ͐̌̄̇̆͆͑̄̎̌̾͊ͬ̅҉̴̛͏͈͉̥̜͕͙A̶̗̟̯̮̩̙̞̙̮͎̮͓̳̝̳͚̗͚̎̄ͯ́͘E̷͉̩̥͇̤̥̱̣̫̠̻̮̥͙̗̝͓̒̉͊͊̒ͤ̅̅̿͂̑͑́̔Ĥ̛̑̓ͭ̃͒̈́̉̆ͮͤ̌ͩͮ͛ͦ͆̑̓͢҉̨҉̜̟͓̩̬U̵̯̯̪̮̲̱͔͙̼͚͓̪͙̞͔͚ͤ̀̑ͥͤ̒͡I̧̡̙͙͈̹̩͇͓̮̰̙̤͙͇̲ͭ͛ͫͮ͌̑ͧ̿͒̑̿ͭ̀̃̑̚͡Ảͬ̂̍̅ͥͮ́̂ͬͧ̃̊ͥͫͮ͏̠̱̠̖̰̗͎̜̬͇̞͔͙͈̼͢F̷͇̪̠̠̗̠͇̺̹̲̭͌̒̽̔ͤ͐͢͝Ḩ̶̿̊̄͌̍͒͗̑ͦ̒̋̃͆ͤͪͤ̋҉͉̗͇͍̗͓͕̟̤̼̝̗̥͖̻ͅA̢ͤ̉̂͏̨̩̝̱͈̩̩̝̳̺̖́H̢̋̏ͧ̆̈́̔̊ͪ͏̢͈̜̳̩̥̜͚̻̪͙̜̼̭̕͘A̴̧͔̞̱̘ͬ͐ͮͫ̎̔ͤ̂͋̉ͧH̡ͯ̉͋͌͐ͬ̀̓̃͌̇̆ͯ͑́̌͑̐͏̳̫̞̤̘̗̭̹̰̗͔̥̀A̧̙͙̦̤̤͔͕̝̥̺̜̠͚̬͆ͭ̔́͐͌̀͛ͫ̊ͮ͛̓ͬ̽ͭ̾̀͡͡ͅH̷͕̘͕̣̙͍̠̓̑̾ͧͬ̑̃̿ͦ̒ͯ̈̄̑̒̇̈̋͢͟͡͝Aͪ̐̄̂ͭͥ҉̛̠̩͕͍̬̳͈͕͓̮̲̱̰̖̮̣̜̞͟͜H̨̟͓͍̩̯̘͕͇̤̹̦̙̗̰͈ͫ͑ͫͨ̍̽̋ͨͩͬͣ͌ͣ͐̃ͦ͊͢A̢̨ͥ̒ͫ̇ͨ͆̅͋ͦ͛͛͐̋̓̚͠҉̘̱͎̺̩̪͖̜̲͚͖̻H̛̟̜̗̳̹̪̺̟͉̲͑͒̿͑̅ͩ̋̐ͧͤ͐ͤ͌͛̎̕͠A̢̧͕̮͈̖̮̳̥͂͊̐ͬͭ͊ͤͣ́̇̓͗̓ͮͬͯ̀̚ͅH͇̮̫̖͍̘͚̖̲̥̉ͭ̓͒̉̓ͩ̐͑͌ͯ͐͂́̚̚͢ͅȂ̢̱̯̯͇̥̱͇̱̞̗͎̏̏͌̐̒̒̅̎̂̓̕ͅĤ̴̤͍̲̃̅̋̄̑̎̑̇ͦͧͧ̚͜͠͠Ā̀̏̇̌̒̅̇́͠҉̴̟̹̹͖͚͓̱̻͚͖͎͇̱̗̝̱̫̮͖͠Ḩ͚̱̺̖̪̰̹̣͉͖͇̼ͬ̓ͧͬ̔̐ͨ̐̾̽͜ͅĄ̷̤̬̰̮̖͕͔͓̮̦̝ͫ̈́ͧͣ͆͢Ą̷̨̋ͭ͋̆̑͌̉ͣͧ̉̕͏̙̳̜͍̝̮̙̼̩̤̘͔̞̤̩ͅH̡̿̑̀͑̈́̈̿̈ͩ̎͏̴̹̞̪̙̼̹̕A̧͊͛͆̇ͤ̒ͥ̋͛̏̅̌̿̾̋̈͌̕͟͏̳̼͔̘̠̯͓̼̟̤͕͎̭̬̳̯̼̩ͅH̨̗͖͈̮̠̦̯ͩ̓̾ͫͩ̋͊̽̿͝ͅ

    
                        """)
                        
  GENERIC_DEATH = Room.new('Death', 'You died.')

  # set the start
  START = CENTRAL_CORRIDOR

  # set up paths between rooms
  CENTRAL_CORRIDOR.add_paths('downloadDLC' => DLC,
  '*' => BEDROOM)

  BEDROOM.add_paths('1' => DRESSED,
                    '2' => SLEEPWIN,
                    '3' => BATHROOM,
                    '4' => DROOM,
                    '5' => SPACE,
                    '*' => BEDROOM)

  DRESSED.add_paths('1' => DRESSED1,
                    '2' => DRESSED2,
                    '3' => DRESSED3,
                    '*' => BEDROOM)
  
  DRESSED1.add_paths('*' => BEDROOM)
  
  DRESSED2.add_paths('*' => BEDROOM)
  
  DRESSED3.add_paths('*' => BEDROOM)
  
  BATHROOM.add_paths('1' => BATHROOM1,
                    '2' =>  BATHROOM2,
                    '3' => BATHROOM3,
                    '4' => BEDROOM,
                    '*' => BATHROOM)
  
  BATHROOM1.add_paths('*' => BATHROOM)
  
  BATHROOM2.add_paths('*' => BATHROOM)
  
  BATHROOM3.add_paths('*' => BATHROOM)
  
  DROOM.add_paths('1' => DROOM125,
                    '2' => DROOM125,
                    '3' => DROOM3,
                    '4' => DROOMDEATH,
                    '5' => DROOM125,
                    '6' => BEDROOM,
                    '*' => DROOM)
  
  DROOM125.add_paths('*' => BEDROOM)
  
  DROOM3.add_paths('*' => BEDROOM)
  
  DRESSED3.add_paths('*' => BEDROOM)
  
  SPACE.add_paths('1' => SPACE1,
                    '2' => SPACEDEATH,
                    '3' => SPACEWIN,
                    '*' => SPACE)
  
  SPACE1.add_paths('*' => HUDDLE)
  
  HUDDLE.add_paths('1' => HUDDLEDEATH,
                    '2' => HUDDLE2,
                    '3' => HUDDLE3,
                    '4' => FINALE,
                    '*' => HUDDLE)
  
  HUDDLE2.add_paths('*' => FINALE)
  
  HUDDLE3.add_paths('*' => FINALE)
  
  FINALE.add_paths('*' => FINALY)
  
  FINALY.add_paths('*' => DLC)
  
  DLC.add_paths('1' => DLC1,
                    '2' => DLC2,
                    '3' => DLC3,
                    '4' => UNDEFINED,
                    '*' => DLC)
  
  DLC1.add_paths('1' => QHOMEROOM,
                 '*' => UNDEFINED)
  
  DLC2.add_paths('*' => UNDEFINED)
  
  DLC3.add_paths('7' => EASTER,
                '*' => NOTHING)
  
  NOTHING.add_paths('Easteregg' => EASTER,
                '*' => UNDEFINED)
                
  QHOMEROOM.add_paths('CONTINUE' => EASTER,
                '*' => UNDEFINED)
  
  UNDEFINED.add_paths('*' => SPACEDEATH)
  # set up room names

  # A whitelist of allowed room names. We use this so that
  # bad people on the internet can't access random variables
  # with names.  You can use Test::constants and Kernel.const_get
  # too.

  ROOM_NAMES = { 'START' => CENTRAL_CORRIDOR,
    'bedroom' => BEDROOM,
    'getting dressed' => DRESSED,
    'normal clothes' => DRESSED1,
    'groovy clothes~' => DRESSED2,
    'rebel' => DRESSED3,
    'sleep ENDING' => SLEEPWIN,
    'bathroom' => BATHROOM,
    'brushy brushy' => BATHROOM1,
    'nice and clean :)' => BATHROOM2,
    'all done' => BATHROOM3,
    'dining room' => DROOM,
    'YUM' => DROOM125,
    'old reference...' => DROOM3,
    'spatial distortion' => SPACE,
    'distortion spatial' => SPACE1,
    'space ENDING' => SPACEWIN,
    'more spatial distortion' => HUDDLE,
    'eavesdropping' => HUDDLE2,
    'greeting the strangers' => HUDDLE3,
    'front of the school' => FINALE,
    'part 1 END' => FINALY,
    'DLC' => DLC,
    'homeroom' => DLC1,
    'slacker' => DLC2,
    '...' => DLC3,
    
    'W̏̍̑͌ͮͥ̾͋͛͏̱̹̩̱̭͓̜̯̘͚̥͠Ĥ̷̤͓̳̠̗̩͙̘̠̖̼̻͚͙̓̑ͥ̀͋̾ͨ̐͠͝͠Ỷ̶̶̟̬̤̲̩̰̘̣̪̻̮̗̈̅̿ͦͧ̑̒͗̈͊͢' => UNDEFINED,
    'other homeroom' => QHOMEROOM,
    'nothing' => NOTHING,
    'EASTER EGG FOUND!' => EASTER
    
  }

  def self::load_room(session)
    # given a session, this will return the right room or nil
    return ROOM_NAMES[session[:room]]
  end

  def self::save_room(session, room)
    # store the room in the session for later, using its name
    session[:room] = ROOM_NAMES.key(room)
  end
end